package com.sifat.newsapp;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Color;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.Button;
import android.widget.GridView;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import com.squareup.picasso.Picasso;
import com.squareup.picasso.Target;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Random;

public class MainActivity extends AppCompatActivity {
    ListView listview;
    ArrayList<HashMap<String,String>>arrayList=new ArrayList<>();
    HashMap<String,String>hashMap;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);


        listview=findViewById(R.id.listview);
        createtable();







        Myadapter myadapter=new Myadapter();//.....adapter k age poricoy korai dite hbe...//

        listview.setAdapter(myadapter);









    }
//============================================================
    //===============================================================

    private class Myadapter extends BaseAdapter{
        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int position) {
            return null;
        }

        @Override
        public long getItemId(int position) {
            return 0;
        }

        @Override
        public View getView(int position, View convertView, ViewGroup viewGroup) {

            LayoutInflater layoutInflater= (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
          View myview=  layoutInflater.inflate(R.layout.item_design,viewGroup,false);



            TextView itemcat=myview.findViewById(R.id.itemcat);
            TextView itemtittle=myview.findViewById(R.id.itemtittle);
            TextView itemdes=myview.findViewById(R.id.itemdes);
            ImageView itemcover=myview.findViewById(R.id.itemcover);

            LinearLayout mainlay=myview.findViewById(R.id.mainlay);

         



            HashMap<String,String>hashmap=arrayList.get(position);



            String cat=hashmap.get("cat");
            String imageurl=hashmap.get("image");
            String tittle=hashmap.get("tittle");
            String des=hashmap.get("des");



            itemcat.setText(cat);
            itemtittle.setText(tittle);
            itemdes.setText(des);




            Picasso.get().load(imageurl)
                    .placeholder(R.drawable.skm)
                    .into(itemcover);





            Random rnd = new Random();
            int color = Color.argb(255, rnd.nextInt(256), rnd.nextInt(256), rnd.nextInt(256));
            itemcat.setBackgroundColor(color);


         


    mainlay.setOnClickListener(new View.OnClickListener() {
        @Override
        public void onClick(View v) {



            MainActivity2.TITTLE=tittle;
            MainActivity2.DESCRIPTION=des;


          Bitmap bitmap=((BitmapDrawable)itemcover.getDrawable()).getBitmap();
          MainActivity2.My_image=bitmap;




            startActivity(new Intent(MainActivity.this, MainActivity2.class));
        }
    });





            return myview ;
        }
    }


//==========================================================================
    //==========================================================================
          //=========================================================================
    public void createtable(){




        hashMap=new HashMap<>();
        hashMap.put("cat","স্কলারশিপ");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153292_137.jpg");
        hashMap.put("tittle","সম্পূর্ণ টিউশন ফি নিয়ে স্নাতকোত্তর করুন নেদারল্যান্ডসে");
        hashMap.put("des","আন্তর্জাতিক শিক্ষার্থীদের সম্পূর্ণ বিনামূল্যে স্নাতকোত্তর প্রোগ্রামে অধ্যায়নের সুযোগ দিচ্ছে নেদারল্যান্ডস। ‘এরিক ব্লুমিঙ্ক স্কলারশিপ’-এর আওতায় নির্বাচিত শিক্ষার্থীরা দেশটির শীর্ষস্থানীয় বিশ্ববিদ্যালয়ে অধ্যায়নের সুযোগ পাবেন। বাংলাদেশসহ অন্যান্য দেশের শিক্ষার্থীরা আবেদন করতে পারবেন। আবেদনের শেষ সময় ১ ডিসেম্বর, ২০২৪। \n" +
                "সুযোগ-সুবিধা\n" +
                "* সম্পূর্ণ টিউশন ফি প্রদান করবে। \n" +
                "* ভ্রমণ খরচ। \n" +
                "* জীবিকা নির্বাহের খরচ।\n" +
                "* স্বাস্থ্যবিমা। \n" +
                "*  এ ছাড়া এ স্কলারশিপের আওতায় বইয়ের খরচ বহন করা হবে। \n" +
                "যোগ্যতাসমূহ\n" +
                "*প্রার্থীদের চমৎকার একাডেমিক রেকর্ড থাকতে হবে। \n" +
                "*ইংরেজি ভাষার দক্ষতা থাকতে হবে। \n" +
                "*পুরো প্রোগ্রাম শেষ করার মানসিকতা থাকতে হবে।\n" +
                "* সুস্বাস্থ্যের অধিকারী হতে হবে। \n" +
                "আবেদনের যোগ্য দেশ\n" +
                "আফগানিস্তান, ভুটান, ইথিওপিয়া, গাম্বিয়া, হাইতি, লাওস, লাইবেরিয়া, মাদাগাস্কার মালাউই, মালি, মোজাম্বিক, মিয়ানমার, নেপাল, নাইজার, রুয়ান্ডা, সেনেগাল, সিয়েরা লিওন, সোমালিয়া, তানজানিয়া, উগান্ডা, ইয়েমেন, দক্ষিণ সুদান, জাম্বিয়া, আর্মেনিয়া, বলিভিয়া, কঙ্গো, ঘানা, হন্ডুরাস, বাংলাদেশ, ভারত প্রমুখ। \n" +
                "আবেদনের পদ্ধতি\n" +
                "অনলাইনে আবেদন করা যাবে। শিক্ষার্থীদের অফিশিয়াল ওয়েবসাইটে গিয়ে প্রয়োজনীয় তথ্য পূরণ করতে হবে, প্রয়োজনীয় নথি জমা দিতে হবে।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat"," কর্মসংস্থান");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153273_161.jpg");
        hashMap.put("tittle","গাইবান্ধা সিভিল সার্জনের কার্যালয়ে শতাধিক নিয়োগ");
        hashMap.put("des", "স্বাস্থ্য অধিদপ্তরের স্বাস্থ্য ও পরিবার কল্যাণ মন্ত্রণালয়ের অধীনে গাইবান্ধা সিভিল সার্জনের কার্যালয়ে রাজস্ব খাতে ৭ পদে ১০১ জন নিয়োগ দেওয়া হবে। এ লক্ষ্যে নিয়োগ বিজ্ঞপ্তি প্রকাশ করা হয়েছে। আগ্রহী প্রার্থীরা আগামী ১৪ অক্টোবর পর্যন্ত আবেদন করতে পারবেন। \n" +
                "\n" +
                "পদের নাম: পরিসংখ্যানবিদ;\n" +
                "পদ সংখ্যা: ৪টি; \n" +
                "বেতন: ১০,২০০-২৪,৬৮০ টাকা (গ্রেড-১৪);\n" +
                "শিক্ষাগত যোগ্যতা: পরিসংখ্যান/গণিত/অর্থনীতি বিষয়ে স্নাতক বা সমমানের ডিগ্রি;\n" +
                "\n" +
                "পদের নাম: কোল্ড চেইন টেকনিশিয়ান;\n" +
                "পদ সংখ্যা: ১টি; \n" +
                "বেতন: ৯,৭০০-২৩,৪৯০ টাকা (গ্রেড-১৫);\n" +
                "শিক্ষাগত যোগ্যতা: রেফ্রিজারেশন বা এয়ার কন্ডিশনিং ট্রেডে উচ্চ মাধ্যমিক সার্টিফিকেট (ভোকেশনাল) পরীক্ষায় উত্তীর্ণ;\n" +
                "পদের নাম: স্টোর কিপার;\n" +
                "পদ সংখ্যা: ৫টি; \n" +
                "বেতন: ৯,৩০০-২২,৪৯০ টাকা (গ্রেড-১৬);\n" +
                "শিক্ষাগত যোগ্যতা: এইচএসসি বা সমমানের পরীক্ষায় উত্তীর্ণ;\n" +
                "পদের নাম: অফিস সহকারী কাম কম্পিউটার মুদ্রাক্ষরিক;\n" +
                "পদ সংখ্যা: ২টি; \n" +
                "বেতন: ৯,৩০০-২২,৪৯০ টাকা (গ্রেড-১৬);\n" +
                "শিক্ষাগত যোগ্যতা: এইচএসসি বা সমমান পরীক্ষায় উত্তীর্ণ;\n" +
                "পদের নাম: স্বাস্থ্য সহকারী;\n" +
                "পদ সংখ্যা: ৮৭টি; \n" +
                "বেতন: ৯,৩০০-২২,৪৯০ টাকা (গ্রেড-১৬);\n" +
                "শিক্ষাগত যোগ্যতা: এইচএসসি বা সমমান পরীক্ষায় উত্তীর্ণ;\n" +
                "পদের নাম: গাড়িচালক;\n" +
                "পদ সংখ্যা: ১টি; \n" +
                "বেতন:  ৯,৩০০-২২,৪৯০ টাকা (গ্রেড-১৬);\n" +
                "শিক্ষাগত যোগ্যতা: জুনিয়র স্কুল সার্টিফিকেট (অষ্টম শ্রেণি) পাস বা সমমানের পরীক্ষায় পাস হতে হবে। বৈধ ড্রাইভিং লাইসেন্সসহ গাড়ি চালনায় বাস্তব অভিজ্ঞতা থাকতে হবে;\n" +
                "পদের নাম: ল্যাবরেটরি অ্যাটেন্ডেন্ট;\n" +
                "পদ সংখ্যা: ১টি; \n" +
                "বেতন: ৮,৫০০-২০,৫৭০ টাকা (গ্রেড-১৯);\n" +
                "শিক্ষাগত যোগ্যতা: এসএসসি বা সমমানের পরীক্ষায় উত্তীর্ণ;\n" +
                "কর্মস্থল: গাইবান্ধা জেলা;\n" +
                "বয়সসীমা: ১৮ থেকে ৩০ বছর;\n" +
                "আবেদন ফি: পদ ভেদে ১১২ থেকে ২২৩ টাকা;\n" +
                "আবেদনের শেষ তারিখ: আগামী ১৪ অক্টোবর;\n");
        arrayList.add(hashMap);




        hashMap=new HashMap<>();
        hashMap.put("cat"," উদ্ভাবন");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153283_138.jpg");
        hashMap.put("tittle","ড্যাফোডিল শিক্ষার্থীর উদ্ভাবনকৃত ‘বাজারদর’ অ্যাপ ভাঙবে বাজার সিন্ডিকেট");
        hashMap.put("des","বাংলাদেশের একটি প্রখ্যাত আইটি শিক্ষাপ্রতিষ্ঠান ড্যাফোডিল ইনস্টিটিউট অব আইটি (ডিআইআইটি)। প্রতিষ্ঠানটির শিক্ষার্থী মো. ইব্রাহিম মোল্লা সম্প্রতি একটি অত্যাধুনিক অ্যাপ ‘বাজারদর’ তৈরি করেছেন। তার উদ্ভাবিত এই অ্যাপ বাজারের মূল্য নির্ধারণে কাজ করবে। বাজার সিন্ডিকেট ভাঙতেও অ্যাপটি যুগান্তকারী পদক্ষেপ হিসেবে কাজ করবে।\n" +
                "\n" +
                "ইব্রাহিম মোল্লার উদ্ভাবন করা অ্যাপটি শুধু গ্রাহকদের সঠিক বাজারমূল্য-ই জানাতে সক্ষম তা নয়, বরং এটি বাজারের সিন্ডিকেট ভেঙে সঠিক মূল্য নিশ্চিতেও গুরুত্বপূর্ণ ভূমিকা পালন করবে। ইব্রাহিম তার তৈরি করা এই অ্যাপটি বাংলাদেশ সরকারকে সম্পূর্ণ বিনামূল্যে প্রদান করতে আগ্রহী।\n" +
                "\n" +
                "যেসব বৈশিষ্ট্য থাকবে অ্যাপে\n" +
                "\n" +
                "\n" +
                "*খাদ্যদ্রব্যের জেলাভিত্তিক সঠিক মূল্য প্রদান করে, যা সাধারণত দেশব্যাপী চালু করা যাবে;\n" +
                "\n" +
                "*ইন্টারনেট সংযোগ ছা্ড়াই আগের ডাটা লোডের মাধ্যমে কাজ করা সম্ভব, তাই গ্রাহকদের জন্য বিশেষভাবে উপযোগী;\n" +
                "\n" +
                "*কোনো সরকারি অর্থ ছাড়াই স্বাধীনভাবে পরিচালিত। বিনামূল্যে সেবা প্রদান করে;\n" +
                "\n" +
                "\n" +
                "*বাজারে কোনো বিক্রেতা অতিরিক্ত মূল্য দাবি করলে গ্রাহক সহজেই সরকার নির্ধারিত মূল্য দেখাতে সক্ষম হবেন;\n" +
                "\n" +
                "*জেলাভিত্তিক খাদ্য মূল্যের তথ্য সংগ্রহ করা যায়;\n" +
                "\n" +
                "*প্রত্যেক জেলার জন্য নির্ধারিত যোগাযোগ নম্বরের সুবিধা আছে, তাই বিক্রেতা কখনো অতিরিক্ত মূল্য দাবি করলে সংশ্লিষ্ট কর্তৃপক্ষের সঙ্গে সহজেই যোগাযোগ করে ব্যবস্থা নেওয়া যাবে;\n" +
                "\n" +
                "\n" +
                "*অ্যাপটির ইন্টারফেস অত্যন্ত সহজ এবং ইউজার ফ্রেন্ডলি, তাই দেশের যেকোনো সাধারণ ব্যবহারকারী খুব সহজেই ব্যবহার করতে পারবেন;\n" +
                "\n" +
                "*খাদ্যমূল্যের তথ্য দ্রুত আপডেট করা যায়। ব্যবসায়ী ও সাধারণ মানুষের জন্য সময়োপযোগী তথ্য প্রদান করে;\n" +
                "\n" +
                "*সরকারি প্রশাসন নিজস্ব প্রশাসনিক স্তর অনুযায়ী মূল্য আপডেট ও অন্যান্য কাস্টমাইজেশন করতে পারবেন, যা পুরোপুরি তাদের নিয়ন্ত্রণাধীন থাকবে;\n" +
                "\n" +
                "যেসব সুবিধা পাওয়া যাবে এই অ্যাপে\n" +
                "\n" +
                "*বাজারে খাদ্যদ্রব্যের সঠিক মূল্য নিশ্চিত হবে, ফলে সাধারণ মানুষ অতিরিক্ত দাম থেকে রক্ষা পাবে;\n" +
                "\n" +
                "*দ্রুতগতিতে কাজ করে ও সহজে ব্যবহার করা যায় বলে অ্যাপটি সবার নিকট অত্যন্ত পছন্দের;\n" +
                "\n" +
                "*অ্যাপটি পুরোপুরি স্বাধীনভাবে পরিচালিত হবে। এটি কোনো সরকারি অর্থ ব্যয় ছাড়াই তৈরি হয়েছে;\n" +
                "\n" +
                "*অ্যাপটি পরিচালনা করতে অতিরিক্ত কর্মী নিয়োগের প্রয়োজন নেই;\n" +
                "\n" +
                "*অ্যাপটি নতুন বাংলাদেশের পথ তৈরি করে একটি সুশাসিত বাজার ব্যবস্থাপনা গড়ে তুলবে;\n" +
                "\n" +
                "ইব্রাহিম মোল্লার উদ্ভাবিত এই অ্যাপ বাজারের দাম নিশ্চিতকরণে বিপ্লব সাধন করবে ও বাজার সিন্ডিকেট ভাঙতে সহায়ক হবে। এ ছাড়া অ্যাপটি সরকার ও সাধারণ মানুষের মধ্যে সংযোগ স্থাপন করবে, যা হবে সঠিক ও সুষ্ঠু বাজার ব্যবস্থাপনার পথে একটি গুরুত্বপূর্ণ পদক্ষেপ।\n" +
                "\n" +
                "‘বাজারদর’ অ্যাপটি বাজারের মূল্য নির্ধারণে একটি স্বপ্নময় বাংলাদেশ গড়ার পথে গুরুত্বপূর্ণ ভূমিকা পালন করবে বলে উদ্ভাবক মো. ইব্রাহিম মোল্লার দাবি করেন।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","খেলাধুলা");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153177_120.jpg");
        hashMap.put("tittle","কেইনের হ্যাটট্রিক, মুসিয়ালার দ্রুততম গোল");
        hashMap.put("des","মাত্র তিনদিন আগেই জাতীয় দলের হয়ে জোড়া গোল করে শততম ম্যাচ রাঙিয়েছেন হ্যারি কেইন। এবার নিজের ক্লাব বায়ার্ন মিউনিখে এসে হ্যাটট্রিক করলেন ইংলিশ ফুটবলার। জার্মান বুন্দেসলিগায় কেইনের হ্যাটট্রিকের দিনে হোলস্টেইন কিয়েলকে ৬-১ গোলে উড়িয়ে গোল উৎসব করেছে বায়ার্ন।\n" +
                "\n" +
                "ম্যাচের মাত্র ১৪ সেকেন্ডে মাঠে আসা দর্শকরা কিছু বুঝে উঠার আগেই জামাল মুসিয়ালার গোল। এই তরুণ ফরোয়ার্ডের ১৪ সেকেন্ডে করা গোলটি বুন্দেসলিগা ইতিহাসের তৃতীয় দ্রততম। এরপর ম্যাচ জুড়েই গোলের বন্যা দেখেছে পুরো স্টেডিয়াম। যার মূল নায়ক হ্যারি কেইন। হ্যাটট্রিক করেছেন ইংলিশ এই তারকা। একই সাথে গোলের দেখা পেলেন বুন্দেসলিগার ১৮ টি দলের সবকটির বিপক্ষেও। মুসিয়ালার পাশাপাশি এই ম্যাচে একবার করে জালের দেখা পেয়েছেন রেমবার্গ ও মাইকেল ওলিস।\n" +
                "দাপুটে এ জয়ে চার ম্যাচের চারটিতে জিতেই লীগ টেবিলে শীর্ষে উঠে এল ভিনসেন্ট কোম্পানি শিষ্যরা। অন্যদিকে বুন্দেসলিগায় বড় জয় পেয়েছে বর্তমান চ্যাম্পিয়ন লেভারকুসেন। হফেনহেইমের মাঠে জাবি আলোনসোর দলের জয় ৪-১ গোলের। বড় জয়ে জোড়া গোল করেছেন বোনিফাসে। এ ছাড়া লেভারকুসেনের হয়ে একবার করে লক্ষ্যভেদ করেছেন টেরিয়ের এবং ভাইরটজ। হফেনহেইমের একমাত্র গোলটি বেরিশার।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","ভর্তি পরীক্ষা");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153233_114.jpg");
        hashMap.put("tittle","কৃষি গুচ্ছের ভর্তি পরীক্ষার তারিখ নিয়ে বিভ্রান্তি, যা বলছে কর্তৃপক্ষ");
        hashMap.put("des","কৃষি গুচ্ছের নয়টি কৃষি বিশ্ববিদ্যালয়ের ২০২৩-২০২৪ শিক্ষাবর্ষের ভর্তি কার্যক্রমের কেন্দ্রীয় ভর্তি কমিটির ১১তম সভা অনিবার্য কারণে স্থগিত করা হয়েছে। তবে রবিবার রাত পর্যন্ত পরীক্ষার সংশ্লিষ্ট ওয়েবসাইটে গিয়ে দেখা যাচ্ছে ৪ অক্টোবর ভর্তির পরীক্ষা অনুষ্ঠিত হবে। কর্তৃপক্ষ বলছে, ওয়েবসাইটে টেকনিক্যাল সমস্যার কারণে এমনটা দেখাচ্ছে। \n" +
                "\n" +
                "ভর্তির পরীক্ষার বিষয়ে সিভাসু রেজিস্ট্রার ও কেন্দ্রীয় ভর্তি পরীক্ষা কমিটির সদস্য সচিব মীর্জা ফারুক ইমাম দ্যা ডেইলি ক্যাম্পাসকে বলেন, ওয়েবসাইটে টেকনিক্যাল সমস্যার কারণে এ রকম দেখাচ্ছে। ৪ অক্টোবর ভর্তি পরীক্ষার বিষয়ে এখনো সিদ্ধান্ত হয়নি। খুব দ্রুত ওয়েবসাইটের এই সমস্যার সমাধান করা হবে।\n" +
                "\n" +
                "এর আগে আজ বিকাল সাড়ে ৩ টায় কৃষি গুচ্ছের ভর্তি পরীক্ষা নিয়ে আয়োজকদের নিয়ে আলোচনা সভায় বসতে চেয়েছিলেন বিশ্ববিদ্যালয় মঞ্জুরী কমিশনের (ইউজিসি) নতুন চেয়ারম্যান অধ্যাপক ড. এস এম এ ফায়েজ। আলোচনা সভায় কৃষি গুচ্ছ ভর্তি পরীক্ষার দিন তারিখ ঠিক হবে বলে আশা করেছিলেন শিক্ষার্থীরা।\n" +
                "\n" +
                "\n" +
                "তবে ভর্তি পরীক্ষা পিছানোর দাবি জানিয়ে আসছে শিক্ষার্থীরা। তারা দেশের সার্বিক পরিস্থিতিতে এক থেকে দেড় মাস পড়াশোনা থেকে দূরে আছে। এছাড়াও দেশের ১২ জেলায় বন্যা হওয়ায় অনেক পরীক্ষার্থী ভর্তি পরীক্ষার জন্য প্রস্তুতি নিতে পারেনি। এসব এলাকার শিক্ষার্থীদের বই, নোট নষ্ট হয়ে গেছে। অল্প সময়ে পরীক্ষার তারিখ নির্ধারণ করলে এসব এলাকার শিক্ষার্থীদের অনেক ক্ষতি হবে। \n" +
                "\n" +
                "ভর্তি বিজ্ঞপ্তি সূত্রে জানা যায়, ২০২৩-২৪ শিক্ষাবর্ষের কৃষি গুচ্ছের ভর্তি পরীক্ষায় মোট ৯টি বিশ্ববিদ্যালয় অংশ নিচ্ছে। এতে মোট আসন সংখ্যা ৩ হাজার ৭১৮টি। এর মধ্যে বাংলাদেশ কৃষি বিশ্ববিদ্যালয়ে ১ হাজার ১১৬টি, বঙ্গবন্ধু শেখ মুজিবুর রহমান কৃষি বিশ্ববিদ্যালয়ে ৪৩৫টি, শেরেবাংলা কৃষি বিশ্ববিদ্যালয়ে ৬৯৮টি, পটুয়াখালী বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে ৪৪৮টি, চট্টগ্রাম ভেটেনারি ও অ্যানিম্যাল সায়েন্সেস ইউনিভার্সিটিতে ২৭০টি, সিলেট কৃষি বিশ্ববিদ্যালয়ে ৪৩১টি, খুলনা কৃষি বিশ্ববিদ্যালয়ে ১৫০টি, হবিগঞ্জ কৃষি বিশ্ববিদ্যালয়ে ৯০টি এবং কুড়িগ্রাম কৃষি বিশ্ববিদ্যালয়ে ৮০টি আসন রয়েছে।\n" +
                "\n" +
                "এর আগে, গত ১৭ এপ্রিল কৃষি গুচ্ছভুক্ত বিশ্ববিদ্যালয়গুলোর ভর্তি বিজ্ঞপ্তি প্রকাশিত হয়। বিজ্ঞপ্তি অনুযায়ী, ভর্তি আবেদন ২২ এপ্রিল শুরু হয়ে শেষ হয় ৩০ মে। বিজ্ঞপ্তির তথ্যানুযায়ী আগামী ২০ জুলাই ভর্তি পরীক্ষা অনুষ্ঠিত হওয়ার কথা। তবে ক্যাম্পাসগুলোতে শিক্ষকদের কর্মবিরতির ফলে গত ১৫ জুলাই চট্টগ্রাম ভেটেরিনারি ও এনিম্যাল সাইন্সেস বিশ্ববিদ্যালয়ের জনসংযোগ ও প্রকাশনা দপ্তর থেকে পাঠানো এক বিজ্ঞপ্তিতে ২০ জুলাই কৃষি গুচ্ছের ভর্তি পরীক্ষা স্থগিত করা হয়।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","ফ্যাশন");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202010/55683_13.jpg");
        hashMap.put("tittle","মেডিকেল কোচিং ছেড়ে সুন্দরীর মুকুট, ঘর ছেড়ে সিনেমায়");
        hashMap.put("des","ভারতীয় চলচ্চিত্র পরিবারে বর্তমানে বিতর্কের আরেক নাম- কঙ্গনা রনৌত। বলিউডে পা রাখার পর থেকে নানা কিছু নিয়ে আলোচনায় এই অভিনেত্রী। বলিউড ‘কুইন’খ্যাত এই নায়িকা সম্প্রতি আবার খবরের শিরোনাম হয়েছেন।\n" +
                "তিনি বলিউডকে ‘এক উদ্ভট শব্দ, হলিউড থেকে চুরি করা একটা নকল জিনিস’ বলে মন্তব্য করেন। ‘বলিউডের অলিখিত নিয়ম হলো, তুমি আমার কুকর্ম গোপন রাখবে, আর আমি তোমার।’— কঙ্গনার এমন তীর্যক মন্তব্য তুমুল বিতর্ক সৃষ্টি করেছে মিডিয়াপাড়ায়। এসব নিয়ে তর্ক গড়িয়েছে দেশটির সংসদেও।\n" +
                "যৌন হয়রানি বা মূলধারার রাজনীতি নিয়েও নিয়ম করে টুইটারে আলোচনার ঝড় তোলেন কঙ্গনা। সুশান্তের অপমৃত্যু, নেপোটিজম আর মাদক কেলেঙ্কারি নিয়ে নিয়মিত আলোচনায় ছিলেন তিনি। কিন্তু কঙ্গনার বলিউড ‘কুইন’ হওয়ার পেছনে আছে চমকে দেওয়া কিছু তথ্য, জেনে নেওয়া যাক সেসব সম্পর্কে।\n" +
                "ভালো ছাত্রী ছিলেন কঙ্গনা। মা–বাবা কঙ্গনাকে চিকিৎসক হওয়ার জন্য চাপ দিচ্ছিলেন। এটা শুনেই পড়াশোনা থেকে মন উঠে গিয়েছিল কঙ্গনার। মাধ্যমিক পাস করে কঙ্গনা চণ্ডীগড়ে যান মেডিকেলের কোচিং করতে। কোচিং করা তো দূরের কথা, নাম লেখালেন একটা সুন্দরী প্রতিযোগিতায়। সেবার বিজয়ীর মুকুট উঠেছিল কঙ্গনার মাথায়ই। তখনই কঙ্গনা ঠিক করেন, তিনি ডাক্তারি পড়বেন না, মডেলিং করবেন। তারপর বিজয়মুকুট ব্যাগে পুরে বাড়ি ফিরে এলেন।\n" +
                "এসে মা–বাবাকে ডেকে তিনি জীবনে কী করতে চান, তা ভাবার জন্য এক বছর সময় চান। শুনেই বকাঝকা শুরু করেন কঙ্গনার বাবা। আর তখনই হাতের কাছে যা ছিল, সব নিয়ে বাড়ি থেকে সোজা চলে যান দিল্লি।\n" +
                "সেখানে গিয়ে কী করবেন কিছুই বুঝে উঠতে পারছিলেন না কঙ্গনা। থিয়েটারে ভর্তি হলেন, শিখছিলেন ফরাসি ভাষাও। সেই সময় কঙ্গনার অ্যাকাউন্টে ৫০ হাজার রুপি ছিল। পুরো টাকা দিয়ে একটা গাউন কিনে কঙ্গনা চলে গেলেন মুম্বাই—উদ্দেশ্য, বড় পর্দায় অভিনয় করা। তারপর গ্যাংস্টার ছবির জন্য অডিশন দিলেন।\n" +
                "পেয়েও গেলেন ছবিটা। তখন কঙ্গনার বয়স মাত্র ১৭ বছর। আর চরিত্রটা ছিল একটা মায়ের। কঙ্গনার গালে টোল পড়ে না। তাঁর কোঁকড়া চুল। বিদেশে শুটিংয়ে যাওয়ার জন্য নেই পাসপোর্ট। ইংরেজিও জানেন না ভালো করে। এসব দ্বিধায় ফেলে দিয়েছিল প্রযোজকদের। তবু ছবিটা পেলেন কঙ্গনা। আর প্রথম ছবিতেই সফলতার দেখা পান তিনি।\n" +
                "এখন কঙ্গনা জয়ললিতার বায়োপিক থালাইভির শুটিং শেষ করেছেন। চলছে ‘তেজস’ সিনেমার প্রস্তুতি।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","রাজনীতি ফ্যাক্ট");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/152701_11.jpg");
        hashMap.put("tittle","উপদেষ্টা নাহিদের বোন দাবি করে ভুয়া লিংক শেয়ার সাবেক ছাত্রলীগ নেতার");
        hashMap.put("des","গণ অধিকার পরিষদের উচ্চতর পরিষদের সদস্য ফাতিমা তাসনিমকে তথ্যপ্রযুক্তি উপদেষ্টা নাহিদের বোন দাবি করে ভুয়া একটি লিংক শেয়ার করেছেন ছাত্রলীগের সাবেক এক নেতা। আদতে উপদেষ্টা নাহিদের সঙ্গে ফাতিমা তাসনিমের মধ্যে কোনো সম্পর্ক নেই। নাহিদ ইসলাম নিজেই খবরটি বিষয়টি জানিয়েছেন। তাছাড়া ফ্যাক্ট চেকিং বা তথ্য যাচাইকারী প্রতিষ্ঠান রিউমার স্ক্যানারও একে ভুয়া খবর বলে জানিয়েছে।\n" +
                "\n" +
                "জানা যায়, ফাতিমা তাসনিম নামের ওই নারী কানাডায় বাংলাদেশ হাইকমিশনে মিথিলা ফারজানার পদে চাকরি পেয়েছেন বলে মঙ্গলবার একটি খবর প্রকাশিত হয়েছে। তাতে ওই নারীর পরিচয় হিসেবে তথ্যপ্রযুক্তি উপদেষ্টা নাহিদ ইসলামের বোন বলা হয়েছে। \n" +
                "\n" +
                "এ বিষয়ে নাহিদ ইসলাম বলেন, ‘ফাতিমা তাসনিম নামের এই নারী আমার পরিবারের কেউ নন। তিনি কোথায় নিয়োগ পেয়েছেন, তা আমি জানি না। তাঁর সঙ্গে আমার কোনো যোগাযোগও নেই। তিনি মূলত গণ–অধিকার পরিষদের নেত্রী।’\n" +
                "\n" +
                "\n" +
                "এদিকে খবরটি যাচাই করে রিউমার স্ক্যানার বলেছে, বিডিপ্যানারোমা নামের এই ভুঁইফোড় সাইটটিতে বর্তমানে মাত্র চারটি নিউজ রয়েছে। এর একটি ফাতিমা তাসনিমকে নিয়ে। ফাতিমা কানাডার বাংলাদেশ মিশনে চাকরিও পাননি। জনপ্রশাসন মন্ত্রণালয় এমন কোনো বিজ্ঞপ্তিই দেয়নি। \n" +
                "\n" +
                "ফাতিমা বলেন, ‘এটা পুরোটাই একটা ভুয়া নিউজ। এর সঙ্গে বাস্তবে কোনো সত্যতা নেই। তা ছাড়া আমি এই ইউনিভার্সিটি (জগন্নাথ) থেকে পড়াশোনা করিনি। সবকিছুই অসত্য ও মিথ্যা।’\n" +
                "\n" +
                "এদিকে, উপদেষ্টা নাহিদের পরিবার নিয়ে ফেসবুকে ভুয়া লিংক শেয়ার করেছেন ঢাকা বিশ্ববিদ্যালয় ছাত্রলীগের সাবেক এক নেতা। শেখ আব্দুল্লাহ নামে এই নেতা ঢাবি শাখা ছাত্রলীগের উপ-প্রচার সম্পাদক ছিলেন। এর আগে বিশ্ববিদ্যালয়ের শহীদ সার্জেন্ট জহুরুল হক হল ছাত্রলীগের সহ-সভাপতির দায়িত্ব পালন করেছেন। পড়াশোনা করেছেন বিশ্ববিদ্যালয়ের ব্যবসায় অনুষদের ইন্টারন্যাশনাল বিজনেস বিভাগ থেকে।\n" +
                "\n" +
                "\n" +
                "এ খবরটি প্রকাশ করা বিডিপ্যানারোমা ওয়েবসাইটটি সম্পর্কে রিউমার স্ক্যানার বলেছে, এই সাইটের বর্তমান যে সংস্করণ, সেটির ডোমেইন ২০২৩ সালের আগস্টে রেজিস্ট্রেশন করা হয়। গত ১২ জুলাই সর্বশেষ আপডেট হওয়া ডোমেইনটির মেয়াদ ২০২৫ সালের আগস্ট পর্যন্ত রয়েছে। তবে সাইটটির অস্তিত্ব পাওয়া যায় ২০১৫ সাল থেকে৷ সে সময় থেকেই নিয়মিত এই সাইটে মনগড়া সংবাদ প্রকাশ করা হচ্ছে। সেগুলো পরে আবার সরিয়েও নেওয়া হয়। সে বছরই একই নামে একটি ফেসবুক পেজও খোলা হয়।\n" +
                "\n" +
                "পেজটি বর্তমানে বাংলাদেশ থেকে দুজন এবং যুক্তরাজ্য থেকে দুজন পরিচালনা করছেন। এই পেজে গেলে এদের কর্মকাণ্ড সম্পর্কে কিছুটা ধারণা পাবেন। ২০১৫, ২০১৬ ও ২০১৭ সালে বেশ সক্রিয় দেখা যায়। সাইটের অনেক লিংক শেয়ার হয় সে সময়। ২০২১ থেকে ২০২৩ সালের মধ্যে হাতেগোনা কয়েকটি পোস্ট দিলেও দুই দিন আগে থেকে নতুন করে সক্রিয় হয়েছে পেজটি। ফাতিমা তাসনিমের বিষয়ে কথিত নিউজের লিংকও শেয়ার হয়েছে।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat"," ইংরেজি মাধ্যম");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202408/150586_188.jpg");
        hashMap.put("tittle","চার পরীক্ষার ফল প্রকাশ ক্যামব্রিজ ইন্টারন্যাশনালের");
        hashMap.put("des","বাংলাদেশি শিক্ষার্থীদের চারটি পরীক্ষার ফল প্রকাশ করেছে ক্যামব্রিজ ইন্টারন্যাশনাল। মঙ্গলবার (২০ আগস্ট) এ তথ্য নিশ্চিত করেছে ক্যামব্রিজ ইন্টারন্যাশনাল এডুকেশন। বিগত বছরগুলোর তুলনায় বিশ্বব্যাপি এ বছর পরীক্ষায় অংশগ্রহণকারীদের সংখ্যা রেকর্ড পরিমাণ বৃদ্ধি পেয়েছে বলেও জানিয়েছে প্রতিষ্ঠানটি।\n" +
                "\n" +
                "ক্যামব্রিজ ইন্টারন্যাশনাল এডুকেশনের প্রকাশিত ফলাফলের মধ্যে রয়েছে—আইজিসিএসই, ‘ও লেভেল’, ইন্টারন্যাশনাল এএস এবং ‘এ লেভেল’ জুন সেশন পরীক্ষার ফলাফল। চলতি ২০২৪ সালের জুন সেশনে বিশ্বব্যাপি  ক্যামব্রিজ আন্তর্জাতিক পরীক্ষায় অংশ নেয় ১.৬ মিলিয়ন শিক্ষার্থী—যা গত বছরের তুলনায় ৯ শতাংশ বেশি।\n" +
                "\n" +
                "\n" +
                "ক্যামব্রিজ ‘ও লেভেল’ এবং আইজিসিএসইতে বাংলাদেশে সর্বোচ্চ গৃহীত বিষয় ছিল বাংলা, ইংরেজি ভাষা এবং গণিত। অন্যদিকে ক্যামব্রিজ ইন্টারন্যাশনাল এএস এবং ‘এ লেভেল’ পরীক্ষায় সর্বোচ্চ গৃহীত বিষয় ছিল গণিত, পদার্থবিদ্যা ও রসায়ন।\n" +
                "\n" +
                "বাংলাদেশের যেসব শিক্ষার্থীরা ফলাফল পেয়েছে তাদের অভিনন্দন জানিয়ে ক্যামব্রিজ ইন্টারন্যাশনাল এডুকেশনের গ্রুপ ম্যানেজিং ডিরেক্টর রড স্মিথ বলেন, শিক্ষার্থীদের এই সাফল্যের নেপথ্যে থাকা ক্যামব্রিজ কমিউনিটির সব শিক্ষকদের বিশেষ ধন্যবাদ। বর্তমান এই পরিবর্তনশীল বিশ্বের উন্নয়ন ও কল্যাণে ভূমিকা রাখতে আন্তর্জাতিক শিক্ষা লাভে তরুণদের আগ্রহ দেখে আমি ভীষণ আনন্দিত।\n" +
                "\n" +
                "শিক্ষার্থীদের শুভেচ্ছা জানিয়েছেন ক্যামব্রিজ-এর দক্ষিণ এশিয়ার ম্যানেজিং ডিরেক্টর অরুণ রাজামনি। তিনি বলেছেন, ক্যামব্রিজ ইন্টারন্যাশনাল জুন ২৪’র পরীক্ষা সেশনে বাংলাদেশের অসাধারণ অর্জনগুলো শিক্ষার্থী, শিক্ষক, সাপোর্ট স্টাফ এবং অভিভাবকদের সম্মিলিত প্রচেষ্টারই প্রতিফলনস্বরূপ। সবাইকে অভিনন্দন এবং সব শিক্ষার্থীদের তাদের পরবর্তী যাত্রার জন্য শুভকামনা।\n" +
                "\n" +
                "প্রসঙ্গত, বিশ্ববিখ্যাত ক্যামব্রিজ বিশ্ববিদ্যালয়ের অলাভজনক প্রতিষ্ঠান ক্যামব্রিজ ইন্টারন্যাশনাল ১৬০টি দেশে প্রায় ১ মিলিয়ন শিক্ষার্থীদের পরিষেবা দিয়ে থাকে। বর্তমানে বাংলাদেশে ৮০টিরও বেশি স্কুল তাদের শিক্ষার্থীদের ক্যামব্রিজ প্রোগ্রাম এবং ডিগ্রি দিয়ে থাকে। শিক্ষার্থীদের জন্য ক্যামব্রিজ পাথওয়ে পাঠ্যক্রমে ক্যামব্রিজ ‘আইজিসিএসই’ ৭০টির বেশি এবং ‘ও’ লেভেলে ৪০টির বেশি বিষয় এবং ক্যামব্রিজ ইন্টারন্যাশনাল ‘এএস’ ও ‘এ’ লেভেলে ৫৫টির বেশি বিষয় রয়েছে।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","একাডেমিক পরীক্ষা");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/152565_150.jpg");
        hashMap.put("tittle","এইচএসসির ফল কবে জানে না আন্তঃশিক্ষা বোর্ড");
        hashMap.put("des","চলতি বছরের এইচএসসি ও সমমান পরীক্ষার ফল কবে নাগাদ প্রকাশ করা হবে তা জানেন না শিক্ষা বোর্ডগুলো সংশ্লিষ্ট কর্মকর্তারা। ফল প্রকাশ কী উপায়ে হবে তা নিয়ে একটি প্রস্তাবনা শিক্ষা মন্ত্রণালয়ে পাঠানো হলেও তা এখনও অনুমোদন হয়নি। তাই কবে নাগাদ ফল প্রকাশ হবে সে বিষয়ে মন্তব্য করতে চাচ্ছেন না। \n" +
                "\n" +
                "সোমবার রাতে শিক্ষা বোর্ডগুলো কর্মকর্তাদের সঙ্গে কথা বলে বিষয়টি জানা গেছে। \n" +
                "\n" +
                "জানতে চাইলে আন্তঃশিক্ষা বোর্ড সমন্বয় কমিটির সভাপতি ও ঢাকা বোর্ডের চেয়ারম্যান অধ্যাপক তপন কুমার সরকার দ্যা ডেইলি ক্যাম্পাসকে জানান, এইচএসসির ফল প্রকাশের প্রস্তাবনা এখনও অনুমোদিত হয়ে আমাদের কাছে আসেনি। তাই কবে নাগাদ ফল প্রকাশ করা হবে সে বিষয়ে এখনই কোন মন্তব্য করা যাচ্ছে না। \n" +
                "\n" +
                "\n" +
                "তিনি আরও বলেন, আমরা ওই প্রস্তাবনায় অনুমোদন পেলে ফল প্রকাশে কতদিন লাগবে সে বিষয়ে মন্তব্য করতে পারবো। মন্ত্রণালয় থেকে আমাদের ওই বিষয়ে অনুমোদন দেয়া হলেই সে অনুযায়ী কাজ শুরু হবে।\n" +
                "\n" +
                "\n" +
                "জানতে চাইলে যশোর শিক্ষা বোর্ডের পরীক্ষা নিয়ন্ত্রক ড. বিশ্বাস শাহিন আহম্মদ দ্যা ডেইলি ক্যাম্পাসকে বলেন, এইচএসসি ও সমমান পরীক্ষার ফল প্রকাশের যে প্রস্তাবনা পরীক্ষা নিয়ন্ত্রকরা প্রস্তুত করেছেন তা ঢাকা বোর্ডের মাধ্যমে শিক্ষা মন্ত্রণালয়ে পাঠানো হয়েছে। মন্ত্রণালয় থেকে সে বিষয়ে অনুমোদনের আগে আমরা কোন মন্তব্য করতে পারছি না। তবে এতটুকু বলতে পারি এইচএসসি ও সমমান পরীক্ষার্থীদের জন্য যেটা মঙ্গলজনক সেভাবেই কাজ করছে শিক্ষা মন্ত্রণালয় ও শিক্ষা বোর্ডগুলো। \n" +
                "\n" +
                "\n" +
                "কোটা সংস্কার আন্দোলনকে কেন্দ্র করে এবার পুরো এইচএসসি পরীক্ষা শেষ করা সম্ভব হয়নি। ১৩টি পত্রের মধ্যে সাতটি পরীক্ষা অনুষ্ঠিত হয়েছিল। বাকি পরীক্ষাগুলো বাতিল করে সাবজেক্ট ম্যাপিং করে ফলাফল প্রকাশ করা হবে বলে শিক্ষাবোর্ড জানিয়েছে।\n" +
                "\n" +
                "এর আগে গত ২১ আগস্ট ঢাকা মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ডে অনুষ্ঠিত এক সভায় এইচএসসি ও সমমান পরীক্ষার ফলাফল কী উপায়ে প্রস্তুত করা হবে সে বিষয়ে প্রস্তাবনার খসড়া প্রস্তুত করার দায়িত্ব দেয়া হয়েছিল শিক্ষা বোর্ডগুলোর পরীক্ষা নিয়ন্ত্রক ও সিস্টেম এনালিস্টদের। ওই সভায় অনুষ্ঠিত হওয়া পরীক্ষাগুলোর নম্বর ও আগের এসএসসি ও জেএসসি পরীক্ষার ফল মূল্যায়ন করে এইচএসসি ও সমমান পরীক্ষার ফল প্রস্তুত করার প্রাথমিক সিদ্ধান্ত হয়েছিল।\n" +
                "গত ২০ আগস্ট বিকালে সচিবালয়ে শিক্ষা মন্ত্রণালয়ের মাধ্যমিক ও উচ্চ শিক্ষা বিভাগে ঢুকে পরীক্ষার্থীদের আন্দোলনের মুখে কোটা সংস্কার আন্দোলন ও ছাত্র-জনতার অভ্যুত্থানের কারণে স্থগিত হওয়া পরীক্ষাগুলো বাতিলের সিদ্ধান্ত নেয় শিক্ষা মন্ত্রণালয়।\n" +
                "\n" +
                "চলতি বছর ৯টি সাধারণ শিক্ষা বোর্ড, কারিগরি বোর্ড ও মাদ্রাসা বোর্ডের অধীনে মোট পরীক্ষার্থী ছিলেন ১৪ লাখ ৫০ হাজার ৭৯০ জন। গত ৩০ জুন এইচএসসি ও সমমান পরীক্ষা শুরু হয়। তবে সরকারি চাকরিতে কোটা সংস্কার আন্দোলন এবং ছাত্র-জনতার অভ্যুত্থানের কারণে উদ্ভূত পরিস্থিতিতে কয়েক দফায় এইচএসসি ও সমমানের পরীক্ষা স্থগিত করা হয়। পরে সিদ্ধান্ত হয় ১১ আগস্ট থেকে নতুন সময়সূচিতে এইচএসসি ও সমমানের পরীক্ষা নেওয়া হবে। গত ৫ আগস্ট প্রধানমন্ত্রীর পদ থেকে আওয়ামী লীগ সভাপতি শেখ হাসিনা পদত্যাগ করে দেশে ছেড়ে চলে গেলে পুলিশ ও ছাত্র-জনতার মধ্যে ব্যাপক সংঘর্ষ হয়। বেশ কয়েকটি থানা পুড়িয়ে দেয়া হয় সেদিন। সেখানেই রক্ষিত ছিল এইচএসসির প্রশ্ন। ফলে বেশ কিছু বিষয়ের প্রশ্ন পুঁড়ে যায় ও অনেকের সামনে চলে আসে। তারপর শিক্ষা প্রশাসন সিদ্ধান্ত নেয় এক মাস পিছিয়ে ১১ সেপ্টেম্বর থেকে পরীক্ষাগুলো নেয়ার। কিন্তু এরপর পরীক্ষার্থীরা বাকি পরীক্ষাগুলো না দেয়ার দাবিতে সারা দেশে আন্দোলন শুরু করেন। \n" +
                "\n" +
                "শিক্ষার্থীদের দাবির মুখে ১১ সেপ্টেম্বর থেকে অনুষ্ঠিত হতে যাওয়া পরীক্ষাগুলো বিষয়ে পুনরায় সিদ্ধান্ত নিতে গত ২০ আগস্ট দুপুরে শিক্ষা মন্ত্রণালয়ের মাধ্যমিক ও উচ্চ শিক্ষা বিভাগে সভায় বসেন শিক্ষা উপদেষ্টা অধ্যাপক ড. ওয়াহিদউদ্দিন মাহমুদসহ শিক্ষা প্রশাসনের কর্মকর্তারা। তখন আরও দুই সপ্তাহ পিছিয়ে অর্ধেক নম্বরে পরীক্ষা নেয়ার সিদ্ধান্ত নেয়া হয়। তবে পরীক্ষার্থীরা এ সিদ্ধান্ত জানতে পেরে সচিবালয়ের সামনে বিক্ষোভ শুরু করেন। এক পর্যায়ে তারা সচিবালয়ে প্রবেশ করে সিনিয়র সচিব শেখ আব্দুর রশিদের কক্ষের সামনে বিক্ষোভ শুরু করেন। তখন সিনিয়র সচিবসহ বেশ কয়েকজন কর্মকর্তা ওই কক্ষে ছিলেন। পরে শিক্ষার্থীদের আন্দোলনের মুখে বিকালে পরীক্ষাগুলো বাতিলের ঘোষণা আসে।  \n");
        arrayList.add(hashMap);


        hashMap=new HashMap<>();
        hashMap.put("cat"," কারিগরি");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202408/149377_149.jpg");
        hashMap.put("tittle","এমপিওভুক্ত হলেন আরও ২০৮ শিক্ষক-কর্মচারী");
        hashMap.put("des","বিভিন্ন বেসরকারি কারিগরি শিক্ষা প্রতিষ্ঠানে কর্মরত আরও ২০৮ জন শিক্ষক-কর্মচারী এমপিওভুক্ত হয়েছেন। তারা বিভিন্ন এইচএসসি বিএম, এসএসসি ভোকেশনাল ও কৃষি ডিপ্লোমা শিক্ষা প্রতিষ্ঠানে কর্মরত রয়েছেন। সম্প্রতি কারিগরি শিক্ষা অধিদপ্তর থেকে তাদের এমপিও কার্যকর করে আদেশ জারি করা হয়েছে।\n" +
                "\n" +
                "জানা গেছে, নতুন এমপিওভুক্ত হওয়া নতুন শিক্ষক-কর্মচারীদের এমপিও জুলাই মাস থেকে কার্যকর হবে। এ তালিকায় গত কয়েক মাসে কমিটি মাধ্যমে নিয়োগ পাওয়া কর্মচারী ও প্রতিষ্ঠান প্রধান ও বেশ কয়েকবছর আগে নিয়োগ পাওয়া শিক্ষকরা রয়েছেন। এমপিও অনুমোদন কমিটির ৩৬তম সভার সিদ্ধান্তের আলোকে এসব শিক্ষক-কর্মচারীকে এমপিওভুক্ত করেছে কারিগরি শিক্ষা অধিদপ্তর। \n" +
                "\n" +
                "২০২০ খ্রিষ্টাব্দের নভেম্বরে জারি হওয়া এমপিও নীতিমালার আলোকে এ শিক্ষক-কর্মচারীদের পদের প্রাপ্যতা থাকায়, নিয়োগের শর্ত পূরণ করায় এবং সনদ সঠিক থাকায় এমপিও অনুমোদন কমিটির সভায় তাদের এমপিওভিুক্ত করার সিদ্ধান্ত নেয়া হয়েছে বলে জানিয়েছে অধিদপ্তর।  ");
        arrayList.add(hashMap);


        hashMap=new HashMap<>();
        hashMap.put("cat","সাধারণ");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/152689_121.jpg");
        hashMap.put("tittle","প্রতিবছর ৫ অক্টোবর উদযাপন হবে বিশ্ব শিক্ষক দিবস, নীতিমালা প্রকাশ");
        hashMap.put("des","ক্লাসে শিক্ষক  © ফাইল ফটো\n" +
                "এখন থেকে প্রতিবছর ৫ অক্টোবর সারা দেশে বিশ্ব শিক্ষক দিবস উদযাপন করা হবে। ইউনেস্কো ঘোষিত প্রতিপাদ্য অনুযায়ী প্রতিবছর দিবসটি উদযাপন করা হবে। প্রাথমিক বিদ্যালয়, মাধ্যমিক স্কুল, কলেজ, মাদ্রাসা, কারিগরি শিক্ষা প্রতিষ্ঠান, মেডিকেল কলেজ, বিশ্ববিদ্যালয়, প্রকৌশল ও বিজ্ঞান প্রযুক্তি বিশ্ববিদ্যালয়ে এক যোগে এ দিবসটি উদযাপন করা হবে। প্রতিবছর বিশ্ব শিক্ষক দিবসে ১২ জন গুণী শিক্ষক পাবেন সম্মাননা। \n" +
                "\n" +
                "এ লক্ষ্যে নীতিমালা প্রস্তুত করে তা প্রকাশ করেছে শিক্ষা মন্ত্রণালয়। শিক্ষা মন্ত্রণালয়ের মাধ্যমিক ও উচ্চ শিক্ষা বিভাগ থেকে এ নীতিমালা প্রকাশ করা হয়। \n" +
                "\n" +
                "জানা গেছে, প্রতিবছর ইউনেস্কো ঘোষিত নীতিমালা অনুযায়ী বিশ্ব শিক্ষক দিবস উদযাপন, জাতি গঠনে ভূমিকা ও অবদান সমাজের সব স্তরের মানুষের কাছে পৌঁছে দেয়া এবং গুণী শিক্ষককে সম্মাননা দেয়ার জন্য সব শিক্ষককে সম্মানিত করা হবে।\n" +
                "\n" +
                "এজন্য গুণী শিক্ষক সম্মাননা কমিটি, উপজেলা পর্যায়ে শিক্ষক দিবস উদযাপন কমিটি, জেলা পর্যায়ে শিক্ষক দিবস উদযাপন কমিটি, জাতীয় স্টিয়ারিং কমিটি, বাজেট কমিটি, প্রচার কমিটি, গুণী শিক্ষক বাছাই কমিটি গঠন করা হয়েছে।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat"," কুইজ");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202306/119106-1.jpg");
        hashMap.put("tittle","ইতিহাস জানুন, পুরষ্কার জিতুন লক্ষাধিক টাকার");
        hashMap.put("des","“ইতিহাস হলো সেই বুদ্ধিবৃত্তিক অনুশীলন, যাতে কোনো সভ্যতা নিজেই তার উত্থান-পতনের অতীত ব্যখ্যা প্রদান করে”—ডাচ ইতিহাসবিদ জন হুজিংগার এই কথাটা আমাদের মস্তিষ্কের দুয়ারে যেনো নতুন করে আলোড়ন তোলে। আর ইতিহাস তো হলো জাতির সেই দর্পণ যেখানে জাতির সফলতা এবং ব্যর্থতার চিত্র ফুটে ওঠে।\n" +
                "\n" +
                "যে জাতি নিজের শেকড় জানেনা, সে কীভাবে নিজেকে চিনবে! শেকড়ের টানে নিজেকে চেনার এই সোনালী যাত্রায় আপনাকে স্বাগতম। শুরু হতে যাচ্ছে ‘ইসলামের ইতিহাস ও সংস্কৃতি অলিম্পিয়াড-১৪৪৪’ এর এবারের আয়োজন।\n" +
                "\n" +
                "সাধারণ শিক্ষার্থীদের মধ্যে ইসলামের ইতিহাস ও সংস্কৃতি চর্চা বাড়াতে ও তাদের আগ্রহী করে তুলতে তৃতীয়বারের মতো জাতীয় পর্যায়ে আয়োজিত হতে যাচ্ছে এই অলিম্পিয়াড। \n" +
                "\n" +
                "\n" +
                "প্রতিযোগিতাটি মূলত কলেজ-বিশ্ববিদ্যালয় ও সমপর্যায়ের কওমি, জেনারেল, আলিয়াসহ সকল মাধ্যমের শিক্ষার্থীদের জন্য সাজানো হয়েছে। তবে হাইস্কুল বা সমপর্যায় থেকে নিয়ে সর্বোচ্চ ৩০ বছর বয়সী যেকোনো আগ্রহী প্রতিযোগী এখানে অংশগ্রহণ করতে পারবেন।\n" +
                "\n" +
                "সিলেবাস, রেজিস্ট্রেশন পদ্ধতি, টাইমলাইন ও অন্যান্য তথ্য-\n" +
                "\n" +
                "প্রতিযোগিতার ধাপসমূহ- \n" +
                "রেজিস্ট্রেশন টাইমলাইন: ২৪ জুন থেকে ১৫ জুলাই ২০২৩\n" +
                "\n" +
                "\n" +
                "প্রাথমিক বাছাই পর্ব: ২৫ আগস্ট\n" +
                "নিবন্ধিত প্রতিযোগীদের নিয়ে অনলাইনে এমসিকিউ পদ্ধতিতে আয়োজিত হবে।\n" +
                "\n" +
                "জাতীয় পর্ব: বাছাইপর্বের  বিজয়ীদের নিয়ে জাতীয় পর্যায়ের লিখিত প্রতিযোগিতা এবং পুরস্কার বিতরণী অনুষ্ঠান।\n" +
                "\n" +
                "রেজিস্ট্রেশন লিংক: http://tiny.cc/reg44\n" +
                "\n" +
                "\n" +
                "রেজিস্ট্রেশন ফি: ১০০ টাকা।\n" +
                "\n" +
                "রেজিস্ট্রেশনের নিয়মাবলী ফর্ম এর লিংকে গেলেই পাওয়া যাবে।\n" +
                "\n" +
                "পুরস্কারসমূহ: সকল অংশগ্রহণকারী পাবেন ডিজিটাল সার্টিফিকেট এবং সেরা ২০০ জন প্রতিযোগী পাবেন নগদ অর্থ, সার্টিফিকেট সহ অন্যান্য আকর্ষণীয় পুরস্কার।\n" +
                "\n" +
                "১ম পুরষ্কার- ৫০ হাজার টাকা  প্রাইজমানি ও সার্টিফিকেট\n" +
                "২য় পুরষ্কার- ৩০ হাজার টাকা প্রাইজমানি ও সার্টিফিকেট।\n" +
                "৩য় পুরষ্কার- ১৫ হাজার টাকা প্রাইজমানি ও সার্টিফিকেট।\n" +
                "৪র্থ পুরষ্কার- ১০ হাজার টাকা প্রাইজমানি ও সার্টিফিকেট।\n" +
                "৫ম পুরষ্কার- ৮ হাজার টাকা প্রাইজমানি ও সার্টিফিকেট।\n" +
                "৬ষ্ঠ থেকে ১০তম- ২ হাজার টাকা প্রাইজমানি ও সার্টিফিকেট ও ১০০০ টাকা সমমূল্যের বই।\n" +
                "১১ তম থেকে ২০ তম- ১ হাজার টাকা প্রাইজমানি ও সার্টিফিকেট ও ১০০০ টাকা সমমূল্যের বই।\n" +
                "২১ তম থেকে ১০০তম পর্যন্ত- ১ হাজার টাকা সমমূল্যের বই ও সার্টিফিকেট।\n" +
                "১০১তম থেকে ২০০তম পর্যন্ত- ৫০০ টাকা সমমূল্যের বই ও সার্টিফিকেট।\n" +
                "\n" +
                "প্রতিযোগিতাটি আয়োজন করেছে ইসলামের ইতিহাস ও সংস্কৃতি অলিম্পিয়াড আয়োজক কমিটি। স্পনসর হিসেবে রয়েছে সোজলার পাবলিকেশন। মিডিয়া পার্টনার হিসেবে রয়েছে আওয়ার ইসলাম এবং সোশ্যাল এনগেজমেন্ট পার্টনার হিসেবে রয়েছে মিম্বার।\n" +
                "\n" +
                "অলিম্পিয়াডের প্রাথমিক বাছাইপর্বের সিলেবাস-\n" +
                "\n" +
                "১. লস্ট ইসলামিক হিস্ট্রি-ফিরাস আল খতিব\n" +
                "২. বাংলাদেশে ইসলাম - আবদুল মান্নান তালিব\n" +
                "৩. বাংলাদেশ ও ইসলাম: আত্মপরিচয়ের ডিসকোর্স- মুসা আল হাফিজ\n" +
                "\n" +
                "সিলেবাসভুক্ত বইগুলোর পিডিএফ পড়ার জন্য ভিজিট করতে পারেন- http://tiny.cc/books44।\n" +
                "\n" +
                "এছাড়া বইগুলো যেকোনো অনলাইন বুকশপ থেকে কিনে পড়ার সুযোগ রয়েছে।\n" +
                "\n" +
                "ভলান্টিয়ার হিসেবে কাজ করতে চাইলে: https://tinyurl.com/mt8m3cfn\n" +
                "\n" +
                "পাশাপাশি অলিম্পিয়াডের প্রস্তুতির জন্য অলিম্পয়াডের টেলিগ্রাম চ্যানেল, ফেসবুক পেজ এবং গ্রুপে বিভিন্ন রিসোর্স শেয়ার করা হবে ইনশাআল্লাহ।\n" +
                "\n" +
                "টেলিগ্রাম চ্যানেলের লিংক নিবন্ধন ফরম সাবমিট করার পর ফর্মের শেষে দেওয়া আছে। \n" +
                "\n" +
                "ফেসবুক গ্রুপ এর লিংক: https://facebook.com/groups/230419045194189/\n" +
                "\n" +
                "অলিম্পিয়াড সংক্রান্ত কোন তথ্য জানার প্রয়োজন হলে পেজে মেসেজ দেওয়া যাবে অথবা ihco.official@gmail.com এই ঠিকানায় ই-মেইল করা যাবে। \n" +
                "\n" +
                "জরুরি প্রয়োজনে: ০১৭০৫৯৮৬৯৫৯ ও ০১৭৭৫৪০০৫৩১ নম্বরে যোগাযোগ করা যাবে।\n");
        arrayList.add(hashMap);


        hashMap=new HashMap<>();
        hashMap.put("cat","শিক্ষা");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153250_135.jpg");
        hashMap.put("tittle","ঢাকা কলেজস্থ জয়পুরহাট ছাত্রকল্যাণের সভাপতি রোমান, সাধারণ সম্পাদক আফ্রিদি");
        hashMap.put("des","রাজধানীর ঢাকা কলেজের জয়পুরহাট জেলা ছাত্রকল্যাণ পরিষদের ৪৮ সদস্যবিশিষ্ট কমিটি গঠন করা হয়েছে। কলেজটির ২০১৮-১৯ শিক্ষাবর্ষের শিক্ষার্থী মাহমুদ হাসান রোমানকে সভাপতি এবং একই শিক্ষাবর্ষের শিক্ষার্থী আফ্রিদি হাসানকে সাধারণ সম্পাদক হিসেবে মনোনিত করা হয়েছে।\n" +
                "শনিবার (১৪ সেপ্টেম্বর) ঢাকা কলেজস্থ জয়পুরহাট জেলা ছাত্রকল্যাণ পরিষদের উপদেষ্টা মন্ডলীর পরামর্শক্রমে পূর্বের কমিটি বিলুপ্ত ঘোষণা করে আগামী এক বছরের জন্য পূর্ণাঙ্গ কমিটির অনুমোদন দেওয়া হয়।\n" +
                "ছাত্রকল্যাণ পরিষদের কার্যক্রম সম্পর্কে উপদেষ্টা মন্ডলীর সদস্য জুয়েল হোসাইন পিয়াস বলেন, ঢাকা কলেজ দেশের অন্যতম একটি শিক্ষা প্রতিষ্ঠান, দেশের বিভিন্ন প্রান্ত থেকে শিক্ষা গ্রহণের জন্য অনেকেই মুখিয়ে থাকে ঢাকা কলেজের দিকে, আমাদের ছাত্র কল্যাণের উদ্দেশ্য আমাদের জেলার শিক্ষার্থীদের মাঝে বন্ধুত্বপূর্ণ সম্পর্ক গঠন করে একে অপরের বিপদে যাতে সহযোগিতা করতে পারে, এছাড়া নতুনদের অনুপ্রাণিত করতে নবীনবরণসহ নানান আয়োজন আমাদের এই ছাত্রকল্যাণ করে আসছে।\n" +
                "উপদেষ্টা মন্ডলীর আরেক সদস্য মিফতাহুল ইসলাম সুইট বলেন, দীর্ঘ বেশ কয়েকবছর যাবৎ আমরা জয়পুরহাট ছাত্র কল্যাণের মাধ্যমে নানান ধরনের সামাজিক কার্যক্রম পরিচালনা করে আসছি, শিক্ষা সংস্কৃতি ও ভ্রাতৃত্বের এই উর্বর ভূমিতে সবাই যাতে মিলেমিশে থাকে এইটাই আমাদের লক্ষ্য।\n" +
                "২০১৮ সালে প্রথম ঢাকা কলেজস্থ জয়পুরহাট জেলা ছাত্রকল্যাণ পরিষদ গঠিত হয়। সেখানে প্রতিষ্ঠাতা সভাপতি হিসেবে ছিলেন ফিরোজ হোসেন ফাহিম, সাধারণ সম্পাদক ছিলেন আহসান হাবিব ইমরান। এছাড়া মাহমুদুল হাসান রেজা, মেফতাহুল ইসলাম সুইট, জুয়েল হোসাইন পিয়াস, ইমতিয়ার আহমেদের হাত ধরে প্রথম আত্মপ্রকাশ ঘটে।\n" +
                "ছাত্রকল্যাণ পরিষদের কার্যক্রম সম্পর্কে সদ্য দায়িত্বপ্রাপ্ত সভাপতি মাহমুদুল হাসান রোমান বলেন, প্রতি বছরই জয়পুরহাট থেকে অনেক শিক্ষার্থী ঢাকা কলেজে ভর্তি হয়, তাদের নানান সুযোগ সুবিধাসহ যেকোনো সমস্যার সমাধানে জয়পুরহাট ছাত্রকল্যাণ তাদের পাশে থাকবে। এ ছাড়া যারা নতুন আসছে তাদেরও দিক নির্দেশনামূলক নানান ধরনের প্রোগামের কথা আমাদের মাথায় রয়েছে।\n" +
                "ছাত্রকল্যাণ পরিষদের কার্যক্রম সম্পর্কে সদ্য দায়িত্বপ্রাপ্ত সাধারণ সম্পাদক আফ্রিদি হাসান বলেন, জয়পুরহাটের শিক্ষার্থীদের জন্য এক আশ্রয়স্থল হয়ে উঠবে আমাদের এই সংগঠন, আমাদের এখানে যেহেতু একাদশ শ্রেণীর শিক্ষার্থীরাও রয়েছে তাদের নিয়েও আমাদের বিশেষ কিছু প্রোগাম থাকবে। \n" +
                "ছাত্রকল্যাণ পরিষদের সহ-সভাপতি: জাহিদ হাসান, মিন্টু পাল, শাহরিয়ার অভি, আল আমিন ইসলাম। \n" +
                "যুগ্ম সাধারণ সম্পাদক: ফাহিম শাহরিয়ার, আব্দুল্লাহ আল নোমান, রয়েল হোসেন নয়ন, রবি সজীব, আল আমিন। \n" +
                "সাংগঠনিক সম্পাদক: ফারহান আদনান মাসুম, শামিম হোসাইন, সাদমান, মেজবাহ, মোস্তাফিজুর রহমান।\n" +
                "এছাড়া দপ্তর সম্পাদক তাওহীদ ইসলাম সজীব, উপ-দপ্তর সম্পাদক জাহিদ হাসান, শিক্ষা ও গবেষণা সম্পাদক জাবেদ ওমর জয়, উপ গবেষণা সম্পাদক জুলফিকার হোসেন, প্রচার সম্পাদক মেহেদি হাসান মাসুম, উপ-প্রচার সম্পাদক আসিফ আল রাজি, রিফাত পারভেজ, তথ্য ও প্রযুক্তি সম্পাদক মোহাম্মদ হাফিজার, তথ্য ও প্রযুক্তি উপ সম্পাদক মোস্তাকিম, সাংস্কৃতিক বিষয়ক সম্পাদক সুমন রহমান, ছাত্র ও বৃত্তি বিষয়ক সম্পাদক তানভির আহমেদ, ছাত্র ও বৃত্তি বিষয়কসহ সম্পাদক মতিয়র রহমান, সমাজসেবা বিষয়ক সম্পাদক সিয়াম আহমেদ, সমাজসেবা বিষয়ক উপ সম্পাদক আরিফুর রহমান পারভেজ, সহ-সম্পাদক তানভীর আহমেদ, আবিদ শাহরিয়ার, আরিফুর রহমান পারভেজ, জাহিদ এবং আল কবির খান।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","অর্থনীতি");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/152991_115.jpg");
        hashMap.put("tittle","সেপ্টেম্বরের প্রথম সপ্তাহেই রেমিট্যান্স ছাড়িয়েছে ৭ হাজার কোটি টাকা");
        hashMap.put("des","সেপ্টেম্বরে  প্রথম সাতদিনেই এসেছে ৫৮ কোটি ৪৫ লাখ ডলারের রেমিট্যান্স। যা বাংলাদেশি মুদ্রায় (প্রতি ডলার ১২০ টাকা হিসাবে) ৭ হাজার ১৪ কোটি টাকা।\n" +
                "\n" +
                "বাংলাদেশ ব্যাংকের সবশেষ প্রতিবেদন বলছে, সেপ্টেম্বরের প্রথম সাতদিনে ৫৮ কোটি ৪৫ লাখ ৪০ হাজার ডলারের রেমিট্যান্স পাঠিয়েছেন বিভিন্ন দেশে বসবাসরত প্রবাসী বাংলাদেশিরা। আর প্রতিদিন আসছে ৮ কোটি ৩৫ লাখ ডলার করে। এভাবে রেমিট্যান্স আসার ধারাবাহিকতা থাকলে চলতি মাসে আড়াই বিলিয়ন ছাড়িয়ে যাবে।\n" +
                "\n" +
                "বাংলাদেশ ব্যাংকের তথ্য বলছে, দেশের ইতিহাসে এক মাসে সর্বোচ্চ ২৬০ কোটি ডলার রেমিট্যান্স এসেছিল ২০২০ সালের জুলাই মাসে। বছর ওয়ারি হিসাবে সর্বোচ্চ রেমিট্যান্স আসে ২০২০-২০২১ অর্থবছরে। ওই অর্থবছরে মোট রেমিট্যান্স আসে ২৪ দশমিক ৭৮ বিলিয়ন বা ২ হাজার ৪৭৮ কোটি ডলার। আর চলতি বছরের জুন মাসে ব্যাংকিং চ্যানেলে মোট ২৫৪ কোটি ডলারের প্রবাসী আয় দেশে এসেছে। বাংলাদেশি মুদ্রায় যা ২৯ হাজার ৭১৮ কোটি টাকা। এটি এখন পর্যন্ত দ্বিতীয় সর্বোচ্চ রেমিট্যান্স বা প্রবাসী আয়।\n" +
                "\n" +
                "\n" +
                "কেন্দ্রীয় ব্যাংকের তথ্যমতে, সদ্য বিদায়ী আগস্ট মাসের পুরো সময়ে দেশে বৈধপথে রেমিট্যান্স এসেছে ২২২ কোটি (২.২২ বিলিয়ন) ডলার। যা আগের বছরের (আগস্ট-২০২৩) একই সময়ের চেয়ে ৬২ কোটি ডলার বেশি। গত বছরের আগস্ট মাসে এসেছিল প্রায় ১৬০ কোটি ডলার রেমিট্যান্স।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","অন্যান্য ফ্যাক্ট");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202408/148858_153.jpg");
        hashMap.put("tittle","আইনজীবী প্রিতমের সঙ্গে জামায়াত নেতাদের আত্মীয়তার দাবিটি ভুয়া");
        hashMap.put("des","সুপ্রিম কোর্টের আইনজীবী মানজুর আল মতিন প্রিতমের সঙ্গে জামায়াত ইসলামীর প্রয়াত শীর্ষ নেতাদের আত্মীয়তার সম্পর্ক রয়েছে বলে সামাজিক যোগাযোগমাধ্যম ফেসবুকের বিভিন্ন প্রোফাইল ও পেজ থেকে দাবি করা হচ্ছে। তবে তথ্য যাচাইকারী বা ফ্যাক্ট চেক প্রতিষ্ঠান ডিসমিসল্যাব জানিয়েছে, এ দাবি সঠিক নয়। আইনজীবী প্রিতমকে নিয়ে মিথ্যা তথ্য ছড়ানো হচ্ছে।\n" +
                "\n" +
                "কোটা সংস্কার আন্দোলনের ছয় সমন্বয়কারীর মুক্তি ও শিক্ষার্থীদের দিকে গুলি ছোড়া বন্ধের নির্দেশনা চেয়ে সুপ্রিম কোর্টের দুই আইনজীবী হাইকোর্টে একটি রিট করেন। তাতে আন্দোলনকারীদের ওপর গুলি না চালাতে নির্দেশনা চাওয়া হয়। দুই আইনজীবীর একজন প্রিতম।\n" +
                "\n" +
                "শিক্ষার্থীদের পক্ষে বক্তব্য দিয়েও প্রিতম ফেসবুকে আলোচনায় রয়েছেন। এমন পরিস্থিতিতেই প্রিতমকে ঘিরে সামাজিক ফেসবুকে বিভিন্ন তথ্য ছড়ানো হয়।\n" +
                "\n" +
                "\n" +
                "ডিসমিসল্যাব বলেছে, গতকাল শুক্রবার সকাল থেকে বাংলাদেশ ছাত্রলীগের অফিশিয়াল ফেসবুক পেজসহ সরকারি দলের বিভিন্ন সমর্থক ও নেতাদের প্রোফাইল থেকে ছড়ানো একাধিক পোস্টে দাবি করা হয়, জামায়াতের সাবেক সংসদ সদস্য হাফেজা আসমা খাতুন প্রিতমের নানি। তার মামা ও খালুর সঙ্গে জামায়াত নেতা যুদ্ধাপরাধী গোলাম আযম ও মতিউর রহমান নিজামীর পারিবারিক সম্পর্ক রয়েছে। \n" +
                "\n" +
                "ডিসমিসল্যাব যাচাই করে দেখতে পেয়েছে, তিনটি দাবিই মিথ্যা এবং পোস্টগুলোতে যাদের নাম উল্লেখ করা হয়েছে, তাদের সঙ্গে প্রিতমের আত্মীয়তার সম্পর্ক নেই।\n" +
                "\n" +
                "ডিসমিসল্যাব প্রিতমের এবং তার মায়ের জাতীয় পরিচয়পত্রের কপি সংগ্রহ করে দেখেছে, তার নানির নাম মাহবুবুন্নেসা। আসমা খাতুন তার নানি নন। বিষয়টি প্রিতমও ডিসমিসল্যাবকে জানিয়েছেন।\n" +
                "\n" +
                "\n" +
                "আসমা খাতুনের সন্তানদের একজনের সঙ্গে ডিসমিসল্যাব যোগাযোগ করেছে। তিনিও নিশ্চিত করেন যে তথ্যগুলো সত্য নয়। তাদের পরিবারে মানজুর নামের একজন সদস্য আছেন। তবে তিনি মানজুর-আল-মতিন প্রিতম নন।\n" +
                "\n" +
                "ফেসবুকে দাবি করা হয়, প্রিতমের আপন মামা হলেন সাইফুল্লাহ মানসুর। কিন্তু ডিসমিসল্যাব বলছে, প্রিতম এবং একটি আলাদা সূত্রে স্বাধীনভাবে নিশ্চিত হওয়া গেছে যে এই প্রিতমের ছোট মামার নাম ‘মনসুরুল খান’, ‘সাইফুল্লাহ মানসুর’ নয়।\n" +
                "\n" +
                "সাইফুল্লাহ মানসুর হলেন জামায়াতের সাবেক সংসদ সদস্য আসমা খাতুনের ছেলে এবং মতিউর রহমান নিজামীর জামাতা। যোগাযোগ করা হলে সাইফুল্লাহ মানসুর নিজেই ডিসমিসল্যাবকে বলেন, প্রিতমের সঙ্গে তার পরিবারের আত্মীয়তার দাবি সম্পূর্ণ মিথ্যা এবং তিনি প্রিতমের মামা নন।\n" +
                "\n");
        arrayList.add(hashMap);

        hashMap=new HashMap<>();
        hashMap.put("cat","পরিবেশ ফ্যাক্ট");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202408/150915_152.jpg");
        hashMap.put("tittle","বন্যায় মৃত্যুর সংখ্যা নিয়ে ছড়িয়ে পড়া খবরটি সত্য নয়");
        hashMap.put("des","সামাজিক যোগাযোগমাধ্যমে ফেনিতে বাচ্চাসহ ৪২৮ জনের মৃত্যু, নোয়াখালীতে ৩৮৫ জনের মৃত্যু, কুমিল্লাতে ১০৩ জনের মৃত্যু শিরোনামে যমুনা টেলিভিশনের একটি ফটোকার্ড ঘুরতে দেখা যায়। শুক্রবার (২৩ আগস্ট) অনেক জনকে সংবাদটি ফেসবুকে শেয়ার করতে দেখা যায়।\n" +
                "\n" +
                "দ্যা ডেইলি ক্যাম্পাসের ফ্যাক্টচেকে জানা যায়, যমুনা টেলিভিশনের অফিসিয়াল ফেসবুক পেজে এবং তাদের নিউজে এ ধরনের কোনও সংবাদ প্রচার করা হয় নি। ছড়িয়ে পড়া ফটোকার্ডটি ভুয়া। এছাড়া প্রকাশিত সংবাদটির কোন সত্যতা খুঁজে পাওয়া যায় নি।\n" +
                "\n" +
                "সর্বশেষ তথ্য অনুযায়ী, ভারী বৃষ্টিপাত ও প্রবল স্রোতের কারণে বন্যার পানিতে ডুবে, পাহাড় ধসে ও বিদ্যুৎস্পৃষ্ট হয়ে সোমবার (১৯ আগস্ট) থেকে বৃহস্পতিবার পর্যন্ত ১৩ জন মারা গেছেন। নিখোঁজ রয়েছেন আরও দুজন।\n" +
                "\n" +
                "\n" +
                "গত বুধবার (২১ আগস্ট) থেকে ফেনীসহ আট জেলায় হঠাৎ বন্যা দেখা দেয়। তবে তার কয়েকদিন আগে থেকেই ভারী বৃষ্টি হচ্ছে অনেক জেলায়। এরপর বাঁধ ভেঙে ও বাঁধ উপচে বৃহস্পতিবার আরও চার জেলার অনেক জায়গা তলিয়ে যায়।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","প্রযুক্তি");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202407/147341_146.jpg");
        hashMap.put("tittle","সমুদ্রে ভাসতে থাকা ভারতীয় জেলেকে উদ্ধারের ঘটনাটি ৫ বছর আগের");
        hashMap.put("des","রবীন্দ্রনাথ দাস নামে ভারতীয় জেলের একটি ছবি সামাজিক যোগাযোগমাধ্যম ফেসবুকে ভাইরাল হয়েছে। জেলেটি প্রায় পাঁচদিন সমুদ্রে ভেসে ছিল। পরে বাংলাদেশি পতাকাবাহী একটি জাহাজের নাবিকরা কক্সবাজারের কুতুবদিয়া থেকে তাকে উদ্ধার করে বলে ভাইরাল হওয়া পোস্টটিতে দাবি করা হয়েছে। \n" +
                "\n" +
                "আজ শনিবার (১৩ জুলাই) বিমান কুমার আচার্য্য নামক একটি ফেসবুক আইডি থেকে এ ছবিটি পোস্ট করা হয়। এরপর মুহূর্তেই তা ভাইরাল হয়ে যায়। ছবিটি ফেসবুকে পোস্ট করার ১৩ ঘণ্টার মধ্যে ৬৯ হাজারের বেশি রিঅ্যাক্ট পড়েছে। পোস্টটি শেয়ার করেছেন সাড়ে ৪ হাজারের বেশি ফেসবুক ব্যবহারকারী। আর পোস্টটিতে কমেন্ট করেছেন ৪ হাজার ফেসবুক ব্যবহারকারী।\n" +
                "\n" +
                "ভাইরাল হওয়া ঘটনা ও ছবিটি কোন সময়কার তা নিয়ে প্রশ্ন উঠেছে নেটিজেনদের মধ্যে। দ্যা ডেইলি ক্যাম্পাসের ফ্যাক্টচেক অনুসন্ধানে দেখা গেছে, ভারতীয় জেলের সমুদ্রে ভেসে থাকার ঘটনাটি ২০১৯ সালের জুলাই মাসের। পাঁচদিন নয়; সমুদ্রে টানা সাতদিন ভেসে ছিলেন এই জেলে। \n" +
                "\n" +
                "জানা গেছে, ২০১৯ সালের ১০ জুলাই বেলা ১১টার দিকে এমভি জাওয়াদের কুতুবদিয়া অবস্থান করার সময় জাহাজের টিম সদস্যরা একটি লোককে সাগরে ভেসে থাকতে দেখে জাহাজের মাস্টারকে জানান। তিনি সঙ্গে সঙ্গে কোস্ট গার্ড, বাংলাদেশ নেভি এবং পোর্টকে খুদে বার্তা পাঠিয়ে বিষয়টি জানান। তবে খারাপ আবহাওয়ার কারণে নেভি ও কোস্টগার্ড সদস্যরা দ্রুত আসতে পারবে না বলে জানায়।\n" +
                "\n" +
                "এ অবস্থায় এমভি জাওয়াদের নাবিকরাই ওই ব্যক্তিকে উদ্ধারের সিদ্ধান্ত নেন। মাস্টার তাঁর টিমকে খুব দ্রুত লাইফ জ্যাকেট, বয়া সাগরে নিক্ষেপ করতে বলেন এবং ভেসে থাকা লোকটিকে চেষ্টার পর উদ্ধার করতে সক্ষম হয় টিম। এরপর তাঁকে জাহাজে তোলেন।\n" +
                "\n" +
                "\n" +
                "এ সময় লোকটিকে মুমূর্ষু ও আতঙ্কিত দেখাচ্ছিল। মাস্টার ও তাঁর উদ্ধার হওয়া ব্যক্তিকে জাহাজে থাকা চিকিৎসক দিয়ে দ্রুত প্রাথমিক চিকিৎসা দেন। এরপর তাঁকে পুষ্টিকর খাবার ও প্রয়োজনীয় পোশাক দেন জাওয়াদের নাবিকরা।\n" +
                "\n" +
                "পরে জিজ্ঞাসাবাদের একপর্যায়ে উদ্ধার হওয়া লোকটি জানান, তিনি জন্মসূত্রে একজন ভারতীয় নাগরিক। পেশায় জেলে। তাঁর নাম রবীন্দ্রনাথ দাস (কানু দাস), বাড়ি পশ্চিমবঙ্গের দক্ষিণ চব্বিশ পরগনায়। ভারতের গভীর সাগরে মাছ ধরতে গিয়েছিলেন। খারাপ আবহাওয়ার কারণে ভারত সাগরের উপকূলে এক সপ্তাহ আগে তাঁর মাছ ধরার ট্রলারটি ১০ জন সঙ্গীসহ সাগরে ডুবে যায়। ডুবে যাওয়ার এক সপ্তাহ ধরে তিনি সাগরেই ভাসছিলেন এবং ভাসতে ভাসতে বাংলাদেশ সীমানা কুতুবদিয়া অংশে ঢুকে পড়েন।\n");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat","স্বায়ত্তশাসিত বিশ্ববিদ্যালয়");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153651_15.jpg");
        hashMap.put("tittle","ঢাবিতে পিটিয়ে যুবক হত্যার ঘটনায় ছাত্রলীগ নেতাসহ ৩ জন আটক");
        hashMap.put("des","ঢাকা বিশ্ববিদ্যালয়ের (ঢাবি) ফজলুল হক মুসলিম হলে চোর সন্দেহে একজনকে হত্যার ঘটনায় ছাত্রলীগ নেতাসহ ৩ জনকে আটক করেছে শাহবাগ থানা পুলিশ। বৃহস্পতিবার (১৯ সেপ্টেম্বর) বিকেল সোয়া ৪টায় বিশ্ববিদ্যালয় প্রশাসনের সহায়তায় ফজলুল হক মুসলিম হল থেকে এই দুজন শিক্ষার্থীকে আটক করা হয়েছে।\n" +
                "\n" +
                "আটক শিক্ষার্থীরা হলেন, হল ছাত্রলীগের সাবেক উপবিজ্ঞান ও প্রযুক্তি সম্পাদক ও পদার্থ বিজ্ঞান বিভাগের জালাল আহমেদ এবং মৃত্তিকা পানি ও পরিবেশ বিভাগের মোহাম্মদ সুমন ও মোস্তাকিন সাকিন। \n" +
                "\n" +
                "বিশ্ববিদ্যালয়ের সহকারী প্রক্টর ড. মুহাম্মদ রফিকুল ইসলাম বলেন, ফজলুল হক হলে মারধরের ঘটনায় ৩ জনকে আটক করে বিকেল ৪টায় শাহবাগ থানায় নেওয়া হয়েছে।\n" +
                "\n" +
                "এরআগে বৃহস্পতিবার (১৯ সেপ্টেম্বর) ঢাকা বিশ্ববিদ্যালয়ের (ঢাবি) ফজলুল হক মুসলিম হলে এক ব্যক্তিকে চোর সন্দেহে পিটিয়ে হত্যার ঘটনায় মামলা দায়ের করেছে বিশ্ববিদ্যালয় প্রশাসন।\n" +
                "\n" +
                "বিশ্ববিদ্যালয় প্রশাসনের পক্ষে এস্টেট অফিসের সুপারভাইজার মোহাম্মদ আমানুল্লাহ শাহবাগ থানায় এজাহার দায়ের করেন।\n" +
                "\n" +
                "মামলার এজাহারে লেখা হয়েছে, গত ১৮ সেপ্টেম্বর সন্ধ্যা ৭টা ৪৫ মিনিটের দিকে একজন যুবক ঢাকা বিশ্ববিদ্যালয়ের ফজলুল হক মুসলিম হলের গেটে সন্দেহজনকভাবে ঘোরাফেরা করতে থাকলে বিশ্ববিদ্যালয়ে কিছু ছাত্র তাকে আটক করে প্রথমে ফজলুল হক মুসলিম হলের মূল ভবনের গেস্টরুমে নিয়ে সে মোবাইল চুরি করেছে বলে এলোপাতাড়ি চর থাপ্পড় ও কিলঘুষি মারে। এ সময় তাকে জিজ্ঞাসা করলে তার নাম- তোফাজ্জল বলে জানায়।\n" +
                "\n" +
                "\n" +
                "এজাহারে আরও উল্লেখ করা হয়, পরবর্তীতে সে মানসিক রোগী বুঝতে পেরে তাকে ফজলুল হক মুসলিম হলের ক্যানটিনে নিয়ে খাবার খাইয়ে তাকে ফজলুল হক মুসলিম হলের দক্ষিণ ভবনে গেস্ট রুমে নিয়ে জানালার সঙ্গে পিছনে হাত বেঁধে স্ট্যাম্প, হকিস্টিক ও লাঠিদ্বারা উচ্ছৃঙ্খল কিছু ছাত্র বেধড়ক মারধর করলে সে অচেতন হয়ে পড়ে। পরে বিষয়টি বিশ্ববিদ্যালয়ের কয়েকজন আবাসিক শিক্ষককে জানালে তাদের সহায়তায় অচেতন যুবককে মেডিকেলে নিয়ে যাওয়া হয়। পরে ওই যুবককে ঢাকা মেডিকেল কলেজ হাসপাতালের জরুরি বিভাগে নিয়ে গেলে ডাক্তার প্রয়োজনীয় পরীক্ষা-নিরীক্ষা করে ১৯ সেপ্টেম্বর রাতে ১২টা ৪৫ মিনিটের সময় তাকে মৃত বলে ঘোষণা করেন।\n" +
                "\n" +
                "এ ঘটনায় হলটির প্রভোস্ট অধ্যাপক ড. শাহ মো. মাসুম সাত সদস্যবিশিষ্ট এ কমিটি গঠন করেছেন। তদন্ত কমিটিকে আজ বৃহস্পতিবার সন্ধ্যা ৬টার মধ্যে তদন্ত রিপোর্ট জমা দিতে অনুরোধ জানানো হয়েছে।");
        arrayList.add(hashMap);

       hashMap=new HashMap<>();
       hashMap.put("cat","সাধারণ");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153218_132.jpg");
        hashMap.put("tittle","নোয়াখালীতে ভয়াবহ বন্যায় শিক্ষাপ্রতিষ্ঠানে ক্ষয়ক্ষতি প্রায় ৪০ কোটি");
        hashMap.put("des","নোয়াখালীতে ভয়াবহ বন্যার কবলে পড়ে  ভিটেমাটি ও রাস্তাঘাট পানির নিচে তলিয়ে যাওয়ায় নিরাপদ পানি ও খাবার সংকটে পড়া মানুষগুলো নিরাপদ আশ্রয়ের জন্য স্থান নিতে হয়েছিল আশ্রয়কেন্দ্রগুলোতে। সরকারি আশ্রয়কেন্দ্রের পাশাপাশি অস্থায়ী আশ্রয়কেন্দ্রগুলো হিসেবে জেলার মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা প্রতিষ্ঠানগুলোও ব্যবহার করা হয়েছিল। \n" +
                "\n" +
                "বন্যাকবলিত মানুষের অবস্থান নেওয়া আশ্রয়কেন্দ্রগুলো ব্যবহারে জেলার মাধ্যমিক ও উচ্চ শিক্ষা বিভাগের আওতাধীন ২৮৪টি শিক্ষাপ্রতিষ্ঠানে প্রায় ২৫ কোটি টাকা এবং কারিগরি ও মাদ্রাসা শিক্ষা বিভাগের আওতাধীন ১৭৯ টি শিক্ষাপ্রতিষ্ঠানে প্রায় ১৫ কোটি টাকার ক্ষয়ক্ষতি হয়েছে বলে জানান নোয়াখালী জেলা শিক্ষা প্রকৌশল অধিদপ্তরের নির্বাহী প্রকৌশলী কার্যালয়ের সহকারী প্রকৌশলী-১ ইনামুল হাসান।\n" +
                "\n" +
                "তিনি বলেন, জেলা মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা কার্যালয়ের সাথে সমন্বয় করে প্রায় ৪০ কোটি টাকার ক্ষয়ক্ষতির পরিমাণ হিসেব করে শিক্ষা প্রকৌশল অধিদফতরের প্রধান কার্যালয়ে পাঠানো হয়েছে।\n" +
                "\n" +
                "তবে ক্ষয়-ক্ষতির পরিমাণ আরো বাড়তে পারে বলে জানিয়েছেন এই কর্মকর্তা। তিনি আরো জানান, বন্যার কবলে পড়ে জেলা শিক্ষা অফিসের ভবন, মসজিদ, গ্যারেজ এবং সীমানা প্রাচীরও ক্ষতিগ্রস্ত হয়। বন্যার পরিস্থিতি উন্নতি হলে ক্ষয়ক্ষতির প্রকৃত হিসেব নিরূপণ করা হবে। \n" +
                "\n" +
                "জেলার একাধিক প্রতিষ্ঠান সরেজমিনে পরিদর্শন করে দেখা যায়, মাধ্যমিক প্রতিষ্ঠানগুলোর পাঠদানের বিভিন্ন আসবাবপত্র, চেয়ার-টেবিল,স্যানিটারি ব্যবস্থা, ইলেকট্রিক্যাল সরঞ্জাম, ফ্লোর,মোজাইক, কাঠের দরজা-জানালা ক্ষতিগ্রস্ত হয়। এছাড়াও বিভিন্ন প্রতিষ্ঠানের ভবন সংলগ্ন মাটি সরে যায়। এছাড়াও বহু শিক্ষাপ্রতিষ্ঠানে সীমানা প্রাচীরের একাংশ ধসে পড়ে।\n" +
                "\n" +
                "এদিকে বন্যা পরিস্থিতির কিছুটা উন্নতি হলেও গত দুদিনে (শুক্রবার ও শনিবার) ভারী বৃষ্টিপাত হওয়ায় ফের পরিস্থিতির অবনতি হয়েছে। এতে জেলার নয়টি উপজেলার মধ্যে আটটিতেই বন্যার পানি বেড়েছে। তবে সবচেয়ে পানি বেশি বেড়েছে জেলার সেনবাগ, বেগমগঞ্জ, সদর, সোনাইমুড়ী ও চাটখিল উপজেলায়। ফলে এলাকার বন্যার্ত মানুষ সীমাহীন কষ্টে দিন যাপন করছেন।\n" +
                "\n" +
                "\n" +
                "এর আগে, নোয়াখালীর বিভিন্ন উপজেলায় গত ১৫ দিন বন্যার পানি স্থানীয় জলাবদ্ধতায় রূপ নেয়। এতে এখনো পানিবন্দি রয়েছে ১১ লাখ ৫৫ হাজার মানুষ। ৩৪৯টি আশ্রয়কেন্দ্রে ৩৫ হাজার ৪৪১ জন মানুষ অবস্থান করছে। বন্যায় এ পর্যন্ত ১১ জনের মৃত্যু হয়েছে।");
        arrayList.add(hashMap);


        hashMap=new HashMap<>();
        hashMap.put("cat"," মাদ্রাসা");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153453_129.jpgপ");
        hashMap.put("tittle","্রক্রিয়াধীন থাকা মাদ্রাসার গ্রন্থাগার শিক্ষক-প্রভাষক নিয়োগ আগের নিয়মে শেষ করার দাবি");
        hashMap.put("des","নতুন নিয়ম চালুর সময় প্রক্রিয়াধীন থাকা মাদ্রাসার গ্রন্থাগার বিষয়ের সহকারী শিক্ষক ও প্রভাষক নিয়োগ আগের নিয়মে শেষ করার দাবি জানিয়েছেন চাকরিপ্রত্যাশী প্রার্থীরা। ২০১৮ সালে এমপিও নীতিমালায় গ্রন্থাগারিক ও সহকারী গ্রন্থাগারিক নামে এ পদ দুটি সৃষ্টি করে ২০২০-২১ অর্থবছর থেকে কমিটির মাধ্যমে নিয়োগ শুরু হয়। তবে ২০২১ সালের ফেব্রুয়ারির শুরু থেকে ওই দুই পদে নিয়োগে ডিজির প্রতিনিধি মনোনয়ন বন্ধ করে দেয় মাদ্রাসা শিক্ষা অধিদপ্তর। ফলে প্রক্রিয়াধীন থাকা নিয়োগ কার্যক্রমগুলো আটকে যায়। পরে একই বছর জুলাইতে ওই দুই পদকে শিক্ষক মর্যাদা দিয়ে নিয়োগ কার্যক্রম পরিচালনার দায়িত্ব দেয়া হয় বেসরকারি শিক্ষক-নিবন্ধন ও প্রত্যয়ন কর্তৃপক্ষকে (এনটিআরসিএ)। ফলে প্রক্রিয়াধীন থাকা নিয়োগ কার্যক্রম আর শুরু করা যায়নি। প্রার্থীরা সে সময় প্রক্রিয়াধীন থাকা মাদ্রাসার গ্রন্থাগার বিষয়ের সহকারী শিক্ষক ও প্রভাষক পদগুলোর নিয়োগ আগের নিয়মে শেষ করার দাবি জানিয়েছেন। \n" +
                "\n" +
                "মঙ্গলবার (১৭ সেপ্টেম্বর) রাজধানীর নিউ বেইলি রোডে মাদ্রাসা শিক্ষা অধিদপ্তরের সামনে সড়কে অবস্থান নিয়ে এ দাবি জানান চাকরি প্রত্যাশী প্রার্থীরা। ‘গ্রন্থাগার ও তথ্য বিজ্ঞান চাকরি প্রত্যাশী ঐক্য পরিষদ’ নামের একটি সংগঠনের ব্যানারে এ কর্মসূচি পালন করেন তারা। \n" +
                "\n" +
                "প্রার্থীরা বলেন,  বেসরকারি শিক্ষাপ্রতিষ্ঠান (মাদ্রাসা) জনবল কাঠামো ও এমপিও নীতিমালা-২০১৮ আলোকে সারা দেশের বিভিন্ন মাদরাসায় গ্রন্থাগারিক ও সহকারী গ্রন্থাগারিক পদ সৃষ্টি করা হয়। ২০২০-২১ অর্থবছর থেকে নিয়োগ শুরু হয় এ দুই পদে। কিন্তু শিক্ষা মন্ত্রণালয়ের কারিগরি ও মাদ্রাসা শিক্ষা বিভাগের তৎকালীন সচিবের মৌখিক নির্দেশনায় ২০২১ সালের ফেব্রুয়ারি থেকে মাদ্রাসা শিক্ষা অধিদপ্তর ওই দুই পদে নিয়োগে ডিজির প্রতিনিধি মনোনয়ন দেয়া হয়নি। পরে ২০২১ সালের ১৮ জুলাই ওই পদ দুটিকে শিক্ষক মর্যাদা দিয়ে গ্রন্থাগার ও তথ্যবিজ্ঞান বিষয়ের সহকারী শিক্ষক ও গ্রন্থাগার ও তথ্যবিজ্ঞান বিষয়ের প্রভাষক নামকরণ করা হয়। শিক্ষক মর্যাদা দেয়ায় ওই পদ দুটিতে নিয়োগ সুপারিশের দায়িত্ব চলে যায় এনটিআরসিএর হাতে। বলা হয়, এ দুই পদে আর কমিটির মাধ্যমে নিয়োগ হবে না। প্রচলিতভাবে কোন নিয়োগের নিয়ম বা পদ্ধতি পরিবর্তন হলে প্রক্রিয়াধীন থাকা নিয়োগ কার্যক্রম আগের নিয়মে চালানোর নির্দেশনা আসে। কিন্তু মাদ্রাসার গ্রন্থাগার ও তথ্য বিজ্ঞান বিষয়ে সহকারী শিক্ষক ও প্রভাষক নিয়োগের ক্ষেত্রে এমনটি হয়নি।পরিষদের সভাপতি খান সাইফুল ইসলাম বলেন, আমরা চাকরির আবেদন করে নিয়োগ পরীক্ষার অপেক্ষায় ছিলাম। কিন্তু কারিগরি ও মাদ্রাসা শিক্ষা বিভাগের তৎকালীন সচিব মৌখিক নির্দেশনা দিয়ে ডিজির প্রতিনিধি মনোনয়ন বন্ধ করার নির্দেশনা দেন। পরে ২০২১ সালের ১৮ জুলাই ওই পদগুলোকে শিক্ষক মর্যাদা দিয়ে নিয়োগের দায়িত্ব এনটিআরসিএকে দেয়া হয়। আমরা সরকারের এই যুগোপযোগী সিদ্ধান্তকে সাধুবাদ জানাই, তবে অতীতের বিভিন্ন সময় এরকম অফিস আদেশ বা পরিপত্রের একাংশে আগে আবেদন করা চাকরিপ্রত্যাশীদের প্রক্রিয়াধীন থাকা নিয়োগ কার্যক্রম আগের নিয়মে সম্পন্ন করার সুযোগ রাখা হয়েছে। কিন্তু মাদ্রাসার  গ্রন্থাগার শিক্ষক ও প্রভাষক নিয়োগের ক্ষেত্রে তা হয়নি। \n" +
                "\n" +
                "তিনি আরও বলেন, মাদ্রাসার প্রক্রিয়াধীন থাকা নিয়োগ পরীক্ষা পূর্বের নীতিমালা অনুযায়ী সম্পন্ন করার দাবিতে আমরা সারা দেশের চাকরিপ্রত্যাশীরা গত তিন বছর ধরে শান্তিপূর্ণ মানববন্ধন কর্মসূচি পালনসহ বিভিন্ন শিক্ষা সংশ্লিষ্ট দপ্তরে ধরনা দিয়েও এখনো পর্যন্ত কোনো সমাধান পাইনি। চাকরির নির্ধারিত বয়স প্রায় শেষের দিকে, তাই চরমভাবে বৈষম্যের শিকার হয়েছি। অবস্থান কর্মসূচিতে আরও বক্তব্য দেন চাকরিপ্রত্যাশী প্রার্থী মাজহারুল ইসলাম, ওলিউর রহমান, আশিকুর রহমান, আবু ইউসুফ আনসারী, মুজিবুর রহমান ক্বাদরী,বেলাল হোসাইন, রেজাউল করিম,মোস্তফা কামাল, আমির হোসেন, আবু জাফরসহ অনেকে।");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat"," উদ্ভাবন");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/152402_116.jpg");
        hashMap.put("tittle","পাখাবিহীন বায়ুকলে বিদ্যুৎ উৎপাদন");
        hashMap.put("des","বিশ্বের বিভিন্ন দেশ বিশাল আকারের তিন পাখাবিশিষ্ট বায়ুকলের মাধ্যমে বিদ্যুৎ উৎপাদন করে থাকে। প্রচলিত এই ধারা থেকে বের হয়ে পাখাবিহীন টারবাইনের মাধ্যমে বিদ্যুৎ উৎপাদন শুরু করেছে যুক্তরাজ্যে। অ্যারোমাইন টেকনোলজিস নামক এক প্রতিষ্ঠান অক্সফোর্ডে জার্মান গাড়ি নির্মাতা বিএমডব্লিউ কারখানার ছাদে পরীক্ষামূলকভাবে বায়ুকল স্থাপন করেছে।\n" +
                "\n" +
                "অ্যারোমাইন টেকনোলজিসের ব্যবস্থাপনা পরিচালক ক্লস লনবর জানিয়েছেন, গতিহীন এই বায়ুকল শব্দ, কম্পন ও বন্য প্রাণীর জন্য হুমকি তৈরি না করে ছাদ থেকে নবায়নযোগ্য শক্তি উৎপাদনে ব্যবহৃত হচ্ছে। গতিহীন বায়ুশক্তির এ পদ্ধতিতে সোলার প্যানেলের মাধ্যমে বিদ্যুৎ সংরক্ষণ করা যায়। \n" +
                "\n" +
                "সাধারণত শীতকালে ও সন্ধ্যাবেলা সৌরশক্তি যখন দুর্বল হয়ে যায়, তখন বায়ুনির্ভর বিদ্যুৎ উৎপাদনের জন্যই বায়ুকলটি বসানো হয়েছে। এই বায়ুকলটি তৈরি করা হয়েছে বিএমডব্লিউ স্টার্টআপ গ্যারেজ নামক এক কর্মসূচির আওতায়।\n" +
                "\n" +
                "প্রাথমিকভাবে ৫০ কিলোওয়াট বা তার বেশি মাত্রার বিদ্যুৎ পাওয়া যাচ্ছে অ্যারোমাইনের তৈরি এই বায়ুকল থেকে। বড় বড় গুদাম, ডেটা সেন্টার, অফিস ও অ্যাপার্টমেন্ট ভবনের মতো বড় ও সমতল ছাদের ওপর বায়ুকলটি সহজেই স্থাপন করা যায়।");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("cat"," উপানুষ্ঠানিক");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/152419_113.jpg");
        hashMap.put("tittle","সাক্ষরতার অগ্রগতি আশানরূপ নয় : গণশিক্ষা উপদেষ্টা");
        hashMap.put("des","সাক্ষরতার ক্ষেত্রে অগ্রগতি আশানরূপ নয় বলে মন্তব্য করেছেন প্রাথমিক ও গণশিক্ষা মন্ত্রণালয়ের উপদেষ্টা অধ্যাপক ডা. বিধান রঞ্জন রায় পোদ্দার। তিনি বলেছেন, শিক্ষা মানুষের অধিকার। ১৯৭২ সালে প্রণীত বাংলাদেশের সংবিধানের ১৭ নং অনুচ্ছেদে নির্ধারিত স্তর পর্যন্ত শিক্ষাকে অবৈতনিক ও বাধ্যতামূলক করা হয়েছে। সাক্ষরতা বিস্তারে এ সাফল্যের জন্য আমরা ১৯৯৮ সালে ইউনেস্কো পুরস্কার পেয়েছি। সাক্ষরতার ক্ষেত্রে অগ্রগতি আশানুরূপ নয়। \n" +
                "\n" +
                "আজ ৮ সেপ্টেম্বর (রবিবার) আন্তর্জাতিক সাক্ষরতা দিবস উপলক্ষে রাজধানীর তেজগাঁওয়ে উপানুষ্ঠানিক শিক্ষা ব্যুরো মিলনায়তনে দিনব্যাপী অনুষ্ঠানে প্রধান অতিথির বক্তব্যে তিনি এসব কথা বলেন। \n" +
                "\n" +
                "উপদেষ্টা আরও বলেন, দক্ষতাভিত্তিক সাক্ষরতা প্রকল্প গ্রহণ করা হয়েছে। প্রকল্পটি একটি ভালো প্রকল্প। এটি পাইলট প্রকল্প হিসেবে গ্রহণ করা হয়েছে। যদি এতে আশানুরূপ ফলাফল হয়, তবে চেষ্টা থাকবে সেটিকে সারাদেশে ছড়িয়ে দেওয়া। \n" +
                "\n" +
                "তিনি বলেন, আমরা শুধু মানুষকে সাক্ষর করে তুলতে চাই না, তাদেরকে দক্ষ হিসেবে গড়ে তুলতে চাই; যেন সে কর্মজীবনে দক্ষ হয়ে উঠতে পারে। \n" +
                "\n" +
                "তিনি আরও বলেন, সাক্ষরতা একটি গুরুত্বপূর্ণ বিষয়। সাক্ষরতার মাধ্যমে একজন মানুষের ব্যক্তিত্ব চেঞ্জ হয়ে যায়। একজনকে সক্ষম করে তোলা মানে তার জ্ঞানের মাত্রাটা অবারিত হয়, অভিজ্ঞতাটা অবারিত হয়, প্রকাশটা অবারিত হয়। সাক্ষর মানুষ একটি জাতির জন্য সম্পদ। বিপুল জনসংখ্যার বাংলাদেশের জনসংখ্যা সম্পদ হতে পারে যদি তাদেরকে স্বাক্ষর করে তুলতে পারি, দক্ষ করে তুলতে পারি। তিনি বলেন, ভাষা ছাড়া অস্তিত্ব কল্পনা করা যায় না, শিশুরা মাতৃভাষায় শিক্ষা গ্রহণ করতে না পারলে তাদের ডেভেলপ হতে সমস্যা হয়। আমরা শুধু দেশের নাগরিক না, আমরা এখন আন্তর্জাতিক নাগরিক। যোগাযোগ, যাতায়াত, অর্থনীতি, সবদিক দিয়ে বিশ্বটাই একটি একীভূত বিষয় হয়ে গেছে। আন্তর্জাতিক নাগরিক হয়ে উঠার জন্য আমাদের অন্য ভাষা চর্চা করা প্রয়োজন। আমাদের বাচ্চাদেরকে যদি বহু ভাষাভাষী করে গড়ে তুলতে পারি তাহলে তারা দেশের জন্য সম্পদ হয়ে দাঁড়াবে। যদি নিজ নিজ দায়িত্ব সঠিকভাবে পালন করি তাহলে দেশ ঠিক হয়ে যাবে।\n" +
                "\n" +
                "উপানুষ্ঠানিক শিক্ষা ব্যুরোর মহাপরিচালক ড. মো. আবুল কালাম আজাদের সভাপতিত্বে অনুষ্ঠানের মধ্যে বক্তব্য রাখেন প্রাথমিক ও গণশিক্ষা মন্ত্রণালয়ের সচিব ফরিদ আহাম্মদ, জাতীয় শিক্ষাক্রম ও পাঠ্যপুস্তক বোর্ডের (এনসিটিবি) চেয়ারম্যান প্রফেসর ড. এ কে এম রিয়াজুল হাসান, বাধ্যতামূলক প্রাথমিক শিক্ষা বাস্তবায়ন পরিবীক্ষণ ইউনিটের মহাপরিচালক নুরজাহান খাতুন, প্রাথমিক শিক্ষা অধিদপ্তরের মহাপরিচালক আব্দুস সামাদ, বাংলাদেশস্থ ইউনেস্কোর প্রতিনিধি সুসান ভাইজসহ অনেকে।\n" +
                "\n" +
                "অনুষ্ঠানের শুরুতে উপদেষ্টা বেলুন, ফেস্টুন ও পায়রা উড়িয়ে ‘আন্তর্জাতিক সাক্ষরতা দিবস-২০২৪’ এর কর্মসূচি উদ্বোধন করেন।\n" +
                "\n" +
                "‘বহু ভাষায় শিক্ষার প্রসার: পারস্পরিক সমঝোতা ও শান্তির জন্য সাক্ষরতা’-এ প্রতিপাদ্য নিয়ে বিশ্বের অন্যান্য দেশের মতো আজ বাংলাদেশেও যথাযোগ্য মর্যাদায় পালিত হচ্ছে আন্তর্জাতিক সাক্ষরতা দিবস উদযাপন করা হচ্ছে। ");
        arrayList.add(hashMap);




        hashMap=new HashMap<>();
        hashMap.put("cat"," স্কলারশিপ");
        hashMap.put("image","https://cdn.thedailycampus.com/resources/img/article/202409/153616_111.jpg");
        hashMap.put("tittle","স্নাতকোত্তর-পিএইচডি করুন আয়ারল্যান্ডে, সঙ্গে থাকছে ২৯ লাখ টাকা");
        hashMap.put("des","ইউরোপের অন্যতম ধনী দেশ আয়ারল্যান্ড। আন্তর্জাতিক শিক্ষার্থীদের অধ্যয়নের জন্য দেশটি খুবই জনপ্রিয়। বিশ্বের শীর্ষ বিশ্ববিদ্যালয়গুলোর ৩ শতাংশই রয়েছে দেশটিতে। বর্তমানে অনেক শিক্ষার্থী এখন পাড়ি জমাচ্ছেন আয়ারল্যান্ডে। এর অন্যতম কারণ হচ্ছে উচ্চশিক্ষায় আয়ারল্যান্ডের বিভিন্ন স্কলারশিপ। \n" +
                "\n" +
                "এর মধ্যে অন্যতম ফুল-ফ্রি স্কলারশিপ হচ্ছে “পোস্টগ্রাজুয়েট স্কলারশিপ প্রোগ্রাম”। এই স্কলারশিপের আওতায় আন্তর্জাতিক শিক্ষার্থীরা আয়ারল্যান্ডের বিশ্ববিদ্যালয়ে স্নাতকোত্তর এবং পিএইচডি প্রোগ্রামে অধ্যায়নের সুযোগ পাবে। বাংলাদেশসহ অন্যান্য দেশের শিক্ষার্থীরা আবেদন করতে পারবেন। আবেদনের শেষ সময় ১০ অক্টোবর ২০২৪। \n" +
                "\n" +
                "যেসব বিশ্ববিদ্যালয়ে পড়া যাবে\n" +
                "* ট্রিনিটি কলেজ ।\n" +
                "* আটলান্টিক টেকনোলজিক্যাল ইউনিভার্সিটি ।\n" +
                "* ডাবলিন সিটি ইউনিভার্সিটি ।\n" +
                "* ডুনডাক ইনস্টিটিউট অব টেকনোলজি ।\n" +
                "* ম্যারি ইমাকুলেট কলেজ ।\n" +
                "* ডাবলিন ডেন্টাল হসপিটাল ।\n" +
                "* কোলাইস্ট মুইরে মারিনো ।\n" +
                "* মাইনথ ইউনিভার্সিটি ।\n" +
                "* মুনস্টার টেকনোলজিক্যাল ইউনিভার্সিটি ।\n" +
                "* ন্যাশনাল ইউনিভার্সিটি অব আর্ট অ্যান্ড ডিজাইন ।\n" +
                "* ন্যাশনাল কলেজ অব আয়ারল্যান্ড ।\n" +
                "* ন্যাশনাল ইউনিভার্সিটি অব আয়ারল্যান্ড ।\n" +
                "* আরসিএসআই ইউনিভার্সিটি অব মেডিসিন অ্যান্ড হেলথ সায়েন্স ।\n" +
                "* রয়েল আইরিশ একাডেমী ।\n" +
                "* রয়েল আইরিশ একাডেমী অব মিউজিক ।\n" +
                "* সাউথ ইস্ট টেকনোলজিক্যাল ইউনিভার্সিটি ।\n" +
                "* টেকনোলজিক্যাল ইউনিভার্সিটি অব দ্য শেনন\n" +
                "* ইউনিভার্সিটি অব কর্ক ।\n" +
                "* ইউনিভার্সিটি অব লিমার্ক ।\n" +
                "* ডুন লাওহের ইনস্টিটিউট অব আর্ট ডিজাইন অ্যান্ড টেকনোলজি ।\n" +
                "\n" +
                "সুযোগ-সুবিধা\n" +
                "* টিউশন ফি মওকুফ। \n" +
                "* শিক্ষার্থীরা বছরে হাতখরচ বাবদ ২২ হাজার ইউরো (বাংলাদেশী টাকায় প্রায় সাড়ে ২৯ লক্ষ ২৩ হাজার ৭১১ টাকা) পাবেন।\n" +
                "* ৩ হাজার ২৫০ ইউরো (বাংলাদেশী টাকায় প্রায় সাড়ে ৪ লক্ষ ৩১ হাজার ৯১১ টাকা) গবেষণা খরচ প্রদান করে থাকে।\n" +
                "* কন্ট্রিবিউশন ফি ৫ হাজার ৭৫০ ইউরো (বাংলাদেশী টাকায় প্রায় সাড়ে ৭ লক্ষ ৬৪ হাজার ১৫১ টাকা) পর্যন্ত দেওয়া হয়ে। \n" +
                "\n" +
                "প্রয়োজনীয় নথিপত্র\n" +
                "* পাসপোর্টের কপি ।\n" +
                "* সার্টিফিকেট।\n" +
                "* রেকমেন্ডেশন লেটার ।\n" +
                "* ইংরেজি ভাষা দক্ষতার সার্টিফিকেট ।\n" +
                "* রিসার্চ প্রপোজাল ।\n" +
                "* সুপারভাইজার ফরম ।\n" +
                "* স্টেটমেন্ট অব পারপাস।\n" +
                "\n" +
                "আয়ারল্যান্ডে উচ্চশিক্ষা\n" +
                " \n" +
                "যেসব বিষয় অধ্যয়ন করা যাবে\n" +
                "* ইঞ্জিনিয়ারিং।\n" +
                "* হিউম্যানিটিজ ও আর্টস বিজনেস ।\n" +
                "* আইন । \n" +
                "* ন্যাচারাল সায়েন্স ।\n" +
                "* হেলথ সায়েন্স ।\n" +
                "* জেনারেল সায়েন্স । \n" +
                "* সোশ্যাল সায়েন্স। \n" +
                "\n" +
                "\n" +
                "আরও পড়ুন: এক ক্লিকে দেখুন ইউরোপের দেশ স্লোভেনিয়ার সেরা নয় স্কলারশিপ\n" +
                "\n" +
                "আবেদনের প্রক্রিয়া\n" +
                "অনলাইনে আবেদন করা যাবে। আবেদনকারীকে প্রথমেই অফিশিয়াল ওয়েবসাইটে একটি অ্যাকাউন্ট খুলতে হবে। সেখানে অ্যাপ্লিকেশন ফরম পূরণ করতে হবে। সব ট্রান্সক্রিপ্ট সত্যায়িত করে আপলোড করতে হবে। সাবমিট করা কাগজপত্রের ভাষা ইংরেজি অথবা আইরিশ হতে হবে। ");
        arrayList.add(hashMap);







    }


}